if(감독 == 최동훈)
{
	res+="11376139 ~\n"
}
else if(?감독 == 추창민)
{
	res+="11376139 ~\n"
}
else if(?감독 == 조스 웨던)
{
	res+="5644069 ~ 11376139\n"
}
else if(?감독 == 조성희)
{
if(개봉 계절 == 여름)
{
	res+="5644069 ~ 11376139\n"
}
else if(개봉 계절 == 가을)
{
	res+="5644069 ~ 11376139\n"
}
else if(개봉 계절 == 봄)
{
	res+="5644069 ~ 11376139\n"
}
else if(개봉 계절 == 겨울)
{
	res+="339294 ~ 615783\n"
}
}
else if(?감독 == 크리스토퍼 놀란)
{
	res+="5644069 ~ 11376139\n"
}
else if(?감독 == 김주호)
{
	res+="3240545 ~ 5644069\n"
}
else if(?감독 == 마크 웹)
{
	res+="3240545 ~ 5644069\n"
}
else if(?감독 == 윤종빈)
{
	res+="3240545 ~ 5644069\n"
}
else if(?감독 == 민규동)
{
if(개봉 계절 == 여름)
{
if(관람등급 == 15세이상관람가)
{
	res+="339294 ~ 615783\n"
}
else if(관람등급 == 12세이상관람가)
{
	res+="339294 ~ 615783\n"
}
else if(관람등급 == 청소년관람불가)
{
	res+="188648 ~ 339294\n"
}
else if(관람등급 == 전체관람가)
{
	res+="339294 ~ 615783\n"
}
}
else if(개봉 계절 == 가을)
{
	res+="3240545 ~ 5644069\n"
}
else if(개봉 계절 == 봄)
{
if(배급사 == 쇼박스㈜미디어플렉스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 씨제이이앤엠 주식회사)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 한국소니픽쳐스릴리징브에나비스타영화㈜)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 워너브러더스코리아(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)넥스트엔터테인먼트월드(NEW))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 롯데쇼핑㈜롯데엔터테인먼트)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 유니버설픽쳐스인터내셔널 코리아(유))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)인벤트스톤)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 영화사청어람(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 필라멘트픽쳐스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 소니픽쳐스릴리징월트디즈니스튜디오스코리아(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 이십세기폭스코리아(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 씨너스엔터테인먼트(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 타임스토리그룹(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)시너지하우스 (시너지))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)에스비에스콘텐츠허브)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)스마일이엔티)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)나이너스엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)엣나인필름)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)미디어데이)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)팝파트너스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)화앤담이엔티)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)시네마서비스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)싸이더스에프앤에이치)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == KT&G 상상마당 영화사업팀 컴퍼니에스에스(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 팝엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)영화사 진진)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)마인스 엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 에이원엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)시네마달)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)티캐스트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 예지림엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 골든타이드픽처스(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 판씨네마㈜)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)팝엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)두타연)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == ㈜미로비젼)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)영화제작전원사)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)영화사 조제)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 롯데쇼핑㈜롯데시네마)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 찬란)
{
	res+="3240545 ~ 564406:9\n"
}
else if(배급사 == ㈜영화사 백두대간)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)영화사조아)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)마운틴픽쳐스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)명필름)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 스튜디오느림보)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == ㈜인디스토리)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == CGV 무비꼴라쥬)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 그린나래미디어(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 뉴원시네마)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 씨네21아이(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)데이지엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)프리비젼엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)인스터피씨엠)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)스크린와이즈)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)키노아이디엠씨)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 오드)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)에스와이코마드)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)서태지컴퍼니)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)화인픽쳐스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 씨제이 씨지브이(CJ CGV)(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (재)전주국제영화제조직위원회)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 데이브인터랙티브)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 시네마달)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)누리픽쳐스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 롤러코스터)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 어뮤즈)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)액티버스엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)소나무픽쳐스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)영화사폴)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)케빈앤컴퍼니)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)엠레콘)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)토러스엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)미디어로그)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 라인트리엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 엠투)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)스넵쏘울)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)컴퍼니엘)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 페퍼민트픽쳐스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)피터팬픽쳐스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 서울독립영화제)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)에이브이에이엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)판다미디어)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 영화사 민들레)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == ㈜크래커픽쳐스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 더 필름클래식 프로덕션)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 프로젝트 엠피)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)드림웨스트픽쳐스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)에이씨피컴퍼니)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 크리에이티브컴즈(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 양전프로덕션)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)케이앤엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 미디어소프트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)데이드림서울)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 이상우 필름)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == ㈜월드시네마)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 야간비행)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)나우콘텐츠)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == ㈜T-JOY)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)루믹스미디어)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)씨맥스커뮤니케이션즈)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)조이앤컨텐츠그룹)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)케이알씨지)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)노이에스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)미디어캐슬)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 스턴트코리아)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 스크린조이)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)머스트 씨 무비)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == ㈜코리아스크린)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)동아수출공사)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 도키엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)테라맥스엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 포커스 온)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == Yellow Pictures)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 익스트림 필름)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)인디플러그)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)마노엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)영진크리에이티브)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 씨네그루(주)다우기술)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 이미지팩토리)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 케이비에스미디어(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)프레인글로벌)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 오퍼스픽쳐스(유))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)수키픽쳐스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)에스피엠)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 문화기획집단 영희야놀자)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)고맙습니다사랑합니다)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 세븐바이투픽쳐스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 브릿지웍스 엔터테인먼트(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 영화사 보라)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == C무비)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 노바엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 얼리버드)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)영화사 빅)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)에이블엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)퍼스트런)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 아이제이미디어(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)미디어이야기)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)더블앤조이픽쳐스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 시네마 뉴원)
{
	res+="3240545 ~ 5644069\n"
}
}
else if(개봉 계절 == 겨울)
{
	res+="3240545 ~ 5644069\n"
}
}
else if(?감독 == 박정우)
{
	res+="3240545 ~ 5644069\n"
}
else if(?감독 == 이용주)
{
	res+="3240545 ~ 5644069\n"
}
else if(?감독 == 이석훈)
{
	res+="3240545 ~ 5644069\n"
}
else if(?감독 == 정지영)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 베리 소넨필드)
{
	res+="3240545 ~ 5644069\n"
}
else if(?감독 == 톰 후퍼)
{
	res+="1888876 ~ 3240545\n"
}
else if(?감독 == 조근현)
{
	res+="1888876 ~ 3240545\n"
}
else if(?감독 == 정병길)
{
	res+="1888876 ~ 3240545\n"
}
else if(?감독 == 빌 콘돈)
{
	res+="1888876 ~ 3240545\n"
}
else if(?감독 == 김대승)
{
	res+="1888876 ~ 3240545\n"
}
else if(?감독 == 피터 잭슨)
{
	res+="1888876 ~ 3240545\n"
}
else if(?감독 == 변영주)
{
	res+="1888876 ~ 3240545\n"
}
else if(?감독 == 김휘)
{
if(관람등급 == 15세이상관람가)
{
	res+="339294 ~ 615783\n"
}
else if(관람등급 == 12세이상관람가)
{
	res+="1888876 ~ 3240545\n"
}
else if(관람등급 == 청소년관람불가)
{
	res+="1888876 ~ 3240545\n"
}
else if(관람등급 == 전체관람가)
{
	res+="1888876 ~ 3240545\n"
}
}
else if(?감독 == 샘 멘데스)
{
	res+="1888876 ~ 3240545\n"
}
else if(?감독 == 올리비에 메가톤)
{
	res+="1888876 ~ 3240545\n"
}
else if(?감독 == 피터 버그)
{
	res+="1888876 ~ 3240545\n"
}
else if(?감독 == 크리스 밀러)
{
	res+="1888876 ~ 3240545\n"
}
else if(?감독 == 김지훈)
{
	res+="1888876 ~ 3240545\n"
}
else if(?감독 == 문현성)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 변성현)
{
if(제작사/수입사 == (주)케이퍼필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 리얼라이즈픽쳐스(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 씨제이이앤엠 주식회사)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 한국소니픽쳐스릴리징브에나비스타영화㈜)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)영화사비단길)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 워너브러더스코리아(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)두타연)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (유)에이디사공육)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)팔레트픽처스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 쇼박스㈜미디어플렉스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)수필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 영화사 집)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)오죤필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)명필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)제이케이필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)아우라픽처스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 유니버설픽쳐스인터내셔널 코리아(유))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 영화사청어람(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)다세포클럽)
{
	res+="0 ~ 3547\n"
}
else if(제작사/수입사 == 판씨네마㈜)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)황기성 사단)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)영화제작소보임)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 영화사 무쇠팔)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 플로우식스(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 자이온이엔티(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)누리픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 히트박스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 소니픽쳐스릴리징월트디즈니스튜디오스코리아(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 이십세기폭스코리아(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)더타워픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)웰메이드스타엠)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 나의PS파트너 문화산업전문회사)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)영화사오름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)삼거리픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)판타지오)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 블루미지)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)영화사채움)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 오퍼스픽쳐스(유))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)케이앤엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)데이지엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)영화사홍)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 정지우 필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == ㈜렛츠필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)영화사울림)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)트로피엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == ㈜더드림앤드픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)주머니필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)빨간마후라)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 휠므빠말주식회사)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 영화사심미안(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)51k)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 드림웍스 애니메이션)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)드림써치C&C)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 한국교육방송공사 EBS)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 올리브스튜디오)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)태원엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)씨네이천)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)영화사아이비젼)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)기안컬처테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)씨네마골뱅이)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)나이너스엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == ㈜사람엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)스마일이엔티)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 영화사 도로시(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 라이온스 게이트 필름즈)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 김기덕 필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)조이앤컨텐츠그룹)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 유니코리아문예투자㈜)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 상상필름(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)황금주전자)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)드림캡쳐)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)에이트볼픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)필통픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)고스트픽처스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)주피터필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 롯데쇼핑㈜롯데엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)더블앤조이픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == ㈜전망좋은 영화사)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 얼리버드)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)포켓몬코리아)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == ㈜코리아스크린)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 타임스토리그룹(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 아일랜드픽처스(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 대원미디어㈜)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)오션필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 스페이스엠(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)조이앤컨텐츠그룹|(주)케이알씨지)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 마포필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)노마드필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)포커스앤컴퍼니)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == ㈜디지아트프로덕션)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 더 애니메이션 픽쳐 컴퍼니)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)조이앤컨텐츠그룹|(주)액티버스엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 필라멘트픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)부메랑모션픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)씨티엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)영화사 진진)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == KT&G 상상마당 영화사업팀 컴퍼니에스에스(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)하리마오픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)제이와이피엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)바른손)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 지오엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)무브픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)매니지먼트 숲)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)대길이에스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)영화사폴)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 씨너스엔터테인먼트(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)화인픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 연분홍 치마)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)티캐스트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)부메랑모션픽쳐스|(주)드림웨스트픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 파라마운트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 청년필름(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 한국게이인권운동단체 친구사이)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)트리니티엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 에이원엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)루믹스미디어)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)메인타이틀픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)드림웨스트픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 케이비에스미디어(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)울림엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)에스비에스콘텐츠허브)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == CNR미디어)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 구혜선 필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 제이엠지엔터테인먼트(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)에스엠엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)영화제작전원사)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)프레인글로벌|(주)드림웨스트픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)씨제스엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 찬란)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 주식회사 풍경소리)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == ㈜영화사엠16)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)온전한 컴퍼니)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)쁘리야)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == ㈜영화사 백두대간)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)인영트레이딩)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)엔브릭스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 크리에이티브 이스트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)마운틴픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 익스트림 필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 민병훈필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 제이오엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)레드로버)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 툰박스 엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)비투이)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)고맙습니다사랑합니다)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)이대희 애니메이션스튜디오)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == CGV 무비꼴라쥬)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 그린나래미디어(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 국가인권위원회)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)영화사 남원)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)영화사 조제)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)스폰지이엔티)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 뉴원시네마)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == ㈜MBC)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 씨네21아이(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == ㈜미로비젼)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 미디어소프트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)영화사 자미)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 부산경남대표방송)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 투니버스(주)온미디어|㈜크래커픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 애니박스 엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == ㈜크래커픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)인스터피씨엠)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 영화사 랑)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)아피아스튜디오)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)컴퍼니엘)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)고유에프앤)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)더줌픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 오드)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 크리스리픽쳐스인터내셔널(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)에스와이코마드)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)서태지컴퍼니)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 와이즈앤와이드엔터테인먼트(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)엣나인필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 세븐바이투픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 테디웍스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)펜타이엔씨)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)씨네365)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)키노아이디엠씨)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == ㈜플래니스 엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)시네마달)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)토러스엔터테인먼트|(주)트리니티네트워크)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 어머니 제작위원회)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)디케이미디어)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)프리비젼엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)디엔티미디어)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 서울시 교육청)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)인벤트스톤)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)보리픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 씨제이 씨지브이(CJ CGV)(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)레인보우팩토리)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (재)전주국제영화제조직위원회)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 애즈필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 얼라이브픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 경픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 데이브인터랙티브)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 가나미디어)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)인디컴미디어)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 반이다)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 스튜디오 오후출근)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 포디렉터스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == ㈜인디스토리)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 러브락컴퍼니)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 롤러코스터)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 피엠피앤컴퍼니)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 라인트리엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 다카포필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 독립프로덕션빨간눈사람)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)피터팬픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 에스비에스 바이아컴 유한회사)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)소나무픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)케빈앤컴퍼니)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 프로덕션공방)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)이든픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 스토리룸)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == LEE FILM)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)나우콘텐츠)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)트리니티네트워크)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 한국영화아카데미)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)영화사조아)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)미디어로그)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 피디픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)스테이지팩토리)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 알토미디어(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 엠투)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 엔터시네마)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)키노크러시)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)스넵쏘울)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 영화사뜰(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 키노망고스틴)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 킹레코드)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 잉스팅크티브 필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 스파이럴 프로젝트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 플라잉타이거픽처스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 페퍼민트픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 스피나치앤빈)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)동녘필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 영화제작소 다)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)노이에스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)맑음영화사)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 이홍재 필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 서울독립영화제)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)미디어캐슬)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)에이브이에이엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 보통영화사)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 필름문)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)씨타도시공간)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 영화사 민들레)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 세도나아이(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 더 필름클래식 프로덕션)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)CMG초록별)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 앤에프통상)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)에이씨피컴퍼니)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 크리에이티브컴즈(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 양전프로덕션)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 버진필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)데이드림서울)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)팔라우픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 이상우 필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == ㈜월드시네마)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 야간비행)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)케이알씨지)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 예지림엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 스턴트코리아)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 비즈니스네크워크)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 골든타이드픽처스(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 스크린조이)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)씨네라인코리아)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)사람과사람)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == ㈜크래커픽쳐스|(주)머스트 씨 무비)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)토러스엔터테인먼트|(주)엣나인필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)동아수출공사)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 도키엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)테라맥스엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 포커스 온)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 영화사히트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 영화사온난전선)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)액티버스엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)인디플러그)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)마노엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)토파즈미디어)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)영진크리에이티브)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)토러스엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 영화제작소 정감)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 주식회사 제이앤피)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 박수건달문화산업전문(유))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 굿초이스컷픽쳐스(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 씨네그루(주)다우기술)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 씨네힐)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 파라마운트 픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 이미지팩토리)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == ㈜화인웍스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)씨엘엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)오콘)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 중국오락문화투자유한회사)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 오지필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)외유내강)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 모티브 필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 디마엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)앤드플러스미디어웍스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)영화사거미)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 필름트레인)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == ㈜씨씨에스미디어)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)영화사소풍)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)수키픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 소울다큐)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 트리필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)유이케이)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 프로덕션 작품(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)사나이픽처스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 페퍼민트앤컴퍼니)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)파트너스케이)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)티피에스컴퍼니)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)애니플러스|(주)토러스엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 디 보나벤츄라 픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 광화문시네마)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)머스트 씨 무비)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 주식회사 뭉클픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 위더스필름(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)미라클필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)파워이엔티)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == ㈜게이트픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 아시아나 국제 단편 영화제)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)스푸키번치)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 케이엠컬쳐㈜)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)메인타이틀픽쳐스|영화사 마농(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 문화예술사업단 BIKI)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)뱅가드스튜디오)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 자파리필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 설문대영상)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 신현원프로덕션)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)퓨어픽쳐스인터내셔널코리아)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)캔들미디어)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)프리콤프로덕션)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 마스터 클래스의 산책 제작위원회)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 초록의 공명)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 주니파워픽처스(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 판타지웍스엔터)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 반달)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 볼)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)크리픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 이십세기폭스 인터내셔널 프로덕션)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)시네마서비스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 시네마팩토리)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 문화기획집단 영희야놀자)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == KBS 미디어)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)인앤인픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)제이엠씨미디어)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 영화사 보라)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)싸이더스에프앤에이치)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)콘텐츠게이트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == ㈜세종커뮤니케이션스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)미인픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)별의별)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 크라켄)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)진진엔터테인먼트필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 주식회사 미콘)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)에이블엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 비트윈(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 감어인 필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)홍필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)무브먼트 픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 모쿠슈라)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)엠씨엠씨)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 우성엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)유무비)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 프로덕션 LAS)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)퍼스트런)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 내일그리고오늘(주))
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == 플랜 비 엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)미디어이야기)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)프라이데이 엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)필마픽쳐스)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)라인필름)
{
	res+="1108072 ~ 1888876\n"
}
else if(제작사/수입사 == (주)뮤제엔터테인먼트)
{
	res+="1108072 ~ 1888876\n"
}
}
else if(?감독 == 정기훈)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 전계수)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 올리비에 나카슈)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 에릭 톨레다노)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 스티브 마티노)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 마이크 트메이어)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 김홍선)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 에릭 다넬)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 톰 맥그라스)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 콘래드 베논)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 유하)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 방은진)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 벤 스타센)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 신태라)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 정지우)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 우민호)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 김형준)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 마크 앤드류스)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 브렌다 채프먼)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 렌 와이즈먼)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 김동원)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 임상수)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 브레드 페이튼)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 임상윤)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 피터 램지)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 한상호)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 토니 길로이)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 정용기)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 우선호)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 권칠인)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 김용한)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 리들리 스콧)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 스콧 스피어)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 신정원)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 조나단 리브스만)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 맥지)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 김태경)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 앤드류 스탠든)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 장규성)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 오스카 요나손)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 토비 젠켈)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 거나 칼슨)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 루퍼트 샌더스)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 리치 무어)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 박철관)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 게리 로스)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 김기덕)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 애스게르 레스)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 팀 버튼)
{
if(제작사/수입사 == (주)케이퍼필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 리얼라이즈픽쳐스(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 씨제이이앤엠 주식회사)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 한국소니픽쳐스릴리징브에나비스타영화㈜)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)영화사비단길)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 워너브러더스코리아(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)두타연)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (유)에이디사공육)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)팔레트픽처스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 쇼박스㈜미디어플렉스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)수필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 영화사 집)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)오죤필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)명필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)제이케이필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)아우라픽처스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 유니버설픽쳐스인터내셔널 코리아(유))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 영화사청어람(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)다세포클럽)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 판씨네마㈜)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)황기성 사단)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)영화제작소보임)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 영화사 무쇠팔)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 플로우식스(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 자이온이엔티(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)누리픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 히트박스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 소니픽쳐스릴리징월트디즈니스튜디오스코리아(주))
{
	res+="3547 ~ 64195\n"
}
else if(제작사/수입사 == 이십세기폭스코리아(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)더타워픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)웰메이드스타엠)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 나의PS파트너 문화산업전문회사)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)영화사오름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)삼거리픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)판타지오)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 블루미지)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)영화사채움)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 오퍼스픽쳐스(유))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)케이앤엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)데이지엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)영화사홍)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 정지우 필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == ㈜렛츠필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)영화사울림)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)트로피엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == ㈜더드림앤드픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)주머니필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)빨간마후라)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 휠므빠말주식회사)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 영화사심미안(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)51k)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 드림웍스 애니메이션)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)드림써치C&C)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 한국교육방송공사 EBS)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 올리브스튜디오)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)태원엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)씨네이천)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)영화사아이비젼)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)기안컬처테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)씨네마골뱅이)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)나이너스엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == ㈜사람엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)스마일이엔티)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 영화사 도로시(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 라이온스 게이트 필름즈)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 김기덕 필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)조이앤컨텐츠그룹)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 유니코리아문예투자㈜)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 상상필름(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)황금주전자)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)드림캡쳐)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)에이트볼픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)필통픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)고스트픽처스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)주피터필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 롯데쇼핑㈜롯데엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)더블앤조이픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == ㈜전망좋은 영화사)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 얼리버드)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)포켓몬코리아)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == ㈜코리아스크린)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 타임스토리그룹(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 아일랜드픽처스(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 대원미디어㈜)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)오션필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 스페이스엠(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)조이앤컨텐츠그룹|(주)케이알씨지)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 마포필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)노마드필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)포커스앤컴퍼니)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == ㈜디지아트프로덕션)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 더 애니메이션 픽쳐 컴퍼니)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)조이앤컨텐츠그룹|(주)액티버스엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 필라멘트픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)부메랑모션픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)씨티엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)영화사 진진)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == KT&G 상상마당 영화사업팀 컴퍼니에스에스(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)하리마오픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)제이와이피엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)바른손)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 지오엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)무브픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)매니지먼트 숲)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)대길이에스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)영화사폴)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 씨너스엔터테인먼트(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)화인픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 연분홍 치마)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)티캐스트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)부메랑모션픽쳐스|(주)드림웨스트픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 파라마운트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 청년필름(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 한국게이인권운동단체 친구사이)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)트리니티엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 에이원엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)루믹스미디어)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)메인타이틀픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)드림웨스트픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 케이비에스미디어(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)울림엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)에스비에스콘텐츠허브)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == CNR미디어)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 구혜선 필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 제이엠지엔터테인먼트(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)에스엠엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)영화제작전원사)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)프레인글로벌|(주)드림웨스트픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)씨제스엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 찬란)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 주식회사 풍경소리)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == ㈜영화사엠16)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)온전한 컴퍼니)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)쁘리야)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == ㈜영화사 백두대간)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)인영트레이딩)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)엔브릭스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 크리에이티브 이스트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)마운틴픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 익스트림 필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 민병훈필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 제이오엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)레드로버)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 툰박스 엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)비투이)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)고맙습니다사랑합니다)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)이대희 애니메이션스튜디오)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == CGV 무비꼴라쥬)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 그린나래미디어(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 국가인권위원회)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)영화사 남원)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)영화사 조제)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)스폰지이엔티)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 뉴원시네마)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == ㈜MBC)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 씨네21아이(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == ㈜미로비젼)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 미디어소프트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)영화사 자미)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 부산경남대표방송)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 투니버스(주)온미디어|㈜크래커픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 애니박스 엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == ㈜크래커픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)인스터피씨엠)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 영화사 랑)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)아피아스튜디오)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)컴퍼니엘)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)고유에프앤)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)더줌픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 오드)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 크리스리픽쳐스인터내셔널(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)에스와이코마드)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)서태지컴퍼니)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 와이즈앤와이드엔터테인먼트(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)엣나인필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 세븐바이투픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 테디웍스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)펜타이엔씨)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)씨네365)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)키노아이디엠씨)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == ㈜플래니스 엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)시네마달)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)토러스엔터테인먼트|(주)트리니티네트워크)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 어머니 제작위원회)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)디케이미디어)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)프리비젼엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)디엔티미디어)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 서울시 교육청)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)인벤트스톤)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)보리픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 씨제이 씨지브이(CJ CGV)(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)레인보우팩토리)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (재)전주국제영화제조직위원회)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 애즈필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 얼라이브픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 경픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 데이브인터랙티브)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 가나미디어)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)인디컴미디어)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 반이다)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 스튜디오 오후출근)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 포디렉터스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == ㈜인디스토리)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 러브락컴퍼니)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 롤러코스터)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 피엠피앤컴퍼니)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 라인트리엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 다카포필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 독립프로덕션빨간눈사람)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)피터팬픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 에스비에스 바이아컴 유한회사)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)소나무픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)케빈앤컴퍼니)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 프로덕션공방)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)이든픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 스토리룸)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == LEE FILM)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)나우콘텐츠)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)트리니티네트워크)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 한국영화아카데미)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)영화사조아)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)미디어로그)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 피디픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)스테이지팩토리)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 알토미디어(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 엠투)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 엔터시네마)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)키노크러시)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)스넵쏘울)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 영화사뜰(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 키노망고스틴)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 킹레코드)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 잉스팅크티브 필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 스파이럴 프로젝트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 플라잉타이거픽처스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 페퍼민트픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 스피나치앤빈)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)동녘필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 영화제작소 다)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)노이에스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)맑음영화사)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 이홍재 필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 서울독립영화제)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)미디어캐슬)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)에이브이에이엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 보통영화사)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 필름문)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)씨타도시공간)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 영화사 민들레)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 세도나아이(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 더 필름클래식 프로덕션)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)CMG초록별)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 앤에프통상)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)에이씨피컴퍼니)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 크리에이티브컴즈(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 양전프로덕션)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 버진필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)데이드림서울)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)팔라우픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 이상우 필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == ㈜월드시네마)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 야간비행)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)케이알씨지)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 예지림엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 스턴트코리아)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 비즈니스네크워크)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 골든타이드픽처스(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 스크린조이)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)씨네라인코리아)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)사람과사람)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == ㈜크래커픽쳐스|(주)머스트 씨 무비)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)토러스엔터테인먼트|(주)엣나인필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)동아수출공사)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 도키엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)테라맥스엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 포커스 온)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 영화사히트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 영화사온난전선)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)액티버스엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)인디플러그)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)마노엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)토파즈미디어)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)영진크리에이티브)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)토러스엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 영화제작소 정감)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 주식회사 제이앤피)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 박수건달문화산업전문(유))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 굿초이스컷픽쳐스(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 씨네그루(주)다우기술)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 씨네힐)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 파라마운트 픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 이미지팩토리)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == ㈜화인웍스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)씨엘엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)오콘)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 중국오락문화투자유한회사)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 오지필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)외유내강)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 모티브 필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 디마엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)앤드플러스미디어웍스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)영화사거미)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 필름트레인)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == ㈜씨씨에스미디어)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)영화사소풍)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)수키픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 소울다큐)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 트리필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)유이케이)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 프로덕션 작품(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)사나이픽처스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 페퍼민트앤컴퍼니)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)파트너스케이)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)티피에스컴퍼니)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)애니플러스|(주)토러스엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 디 보나벤츄라 픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 광화문시네마)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)머스트 씨 무비)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 주식회사 뭉클픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 위더스필름(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)미라클필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)파워이엔티)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == ㈜게이트픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 아시아나 국제 단편 영화제)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)스푸키번치)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 케이엠컬쳐㈜)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)메인타이틀픽쳐스|영화사 마농(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 문화예술사업단 BIKI)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)뱅가드스튜디오)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 자파리필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 설문대영상)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 신현원프로덕션)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)퓨어픽쳐스인터내셔널코리아)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)캔들미디어)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)프리콤프로덕션)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 마스터 클래스의 산책 제작위원회)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 초록의 공명)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 주니파워픽처스(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 판타지웍스엔터)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 반달)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 볼)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)크리픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 이십세기폭스 인터내셔널 프로덕션)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)시네마서비스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 시네마팩토리)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 문화기획집단 영희야놀자)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == KBS 미디어)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)인앤인픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)제이엠씨미디어)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 영화사 보라)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)싸이더스에프앤에이치)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)콘텐츠게이트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == ㈜세종커뮤니케이션스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)미인픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)별의별)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 크라켄)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)진진엔터테인먼트필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 주식회사 미콘)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)에이블엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 비트윈(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 감어인 필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)홍필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)무브먼트 픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 모쿠슈라)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)엠씨엠씨)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 우성엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)유무비)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 프로덕션 LAS)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)퍼스트런)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 내일그리고오늘(주))
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == 플랜 비 엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)미디어이야기)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)프라이데이 엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)필마픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)라인필름)
{
	res+="339294 ~ 615783\n"
}
else if(제작사/수입사 == (주)뮤제엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
}
else if(?감독 == 타셈 싱)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 라이언 존슨)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 한지승)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 폴 W.S. 앤더슨)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 시즈노 코분)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 야마모토 야스이치로)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 정승구)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 김달중)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 제임스 매더스)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 스테판 St. 레게르)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 사이먼 웨스트)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 데이빗 핀처)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 김동빈)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 조쉬 트랭크)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 우디 알렌)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 티무르 베크맘베토브)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 김진영)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 정범식)
{
if(관람등급 == 15세이상관람가)
{
	res+="339294 ~ 615783\n"
}
else if(관람등급 == 12세이상관람가)
{
	res+="339294 ~ 615783\n"
}
else if(관람등급 == 청소년관람불가)
{
	res+="188648 ~ 339294\n"
}
else if(관람등급 == 전체관람가)
{
	res+="339294 ~ 615783\n"
}
}
else if(?감독 == 임대웅)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 홍지영)
{
if(배급사 == 쇼박스㈜미디어플렉스)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 씨제이이앤엠 주식회사)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 한국소니픽쳐스릴리징브에나비스타영화㈜)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 워너브러더스코리아(주))
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)넥스트엔터테인먼트월드(NEW))
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 롯데쇼핑㈜롯데엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 유니버설픽쳐스인터내셔널 코리아(유))
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)인벤트스톤)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 영화사청어람(주))
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 필라멘트픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 소니픽쳐스릴리징월트디즈니스튜디오스코리아(주))
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 이십세기폭스코리아(주))
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 씨너스엔터테인먼트(주))
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 타임스토리그룹(주))
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)시너지하우스 (시너지))
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)에스비에스콘텐츠허브)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)스마일이엔티)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)나이너스엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)엣나인필름)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)미디어데이)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)팝파트너스)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)화앤담이엔티)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)시네마서비스)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)싸이더스에프앤에이치)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == KT&G 상상마당 영화사업팀 컴퍼니에스에스(주))
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 팝엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)영화사 진진)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)마인스 엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 에이원엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)시네마달)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)티캐스트)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 예지림엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 골든타이드픽처스(주))
{
	res+="0 ~ 3547\n"
}
else if(배급사 == 판씨네마㈜)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)팝엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)두타연)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == ㈜미로비젼)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)영화제작전원사)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)영화사 조제)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 롯데쇼핑㈜롯데시네마)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 찬란)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == ㈜영화사 백두대간)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)영화사조아)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)마운틴픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)명필름)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 스튜디오느림보)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == ㈜인디스토리)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == CGV 무비꼴라쥬)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 그린나래미디어(주))
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 뉴원시네마)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 씨네21아이(주))
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)데이지엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)프리비젼엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)인스터피씨엠)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)스크린와이즈)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)키노아이디엠씨)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 오드)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)에스와이코마드)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)서태지컴퍼니)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)화인픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 씨제이 씨지브이(CJ CGV)(주))
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (재)전주국제영화제조직위원회)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 데이브인터랙티브)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 시네마달)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)누리픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 롤러코스터)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 어뮤즈)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)액티버스엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)소나무픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)영화사폴)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)케빈앤컴퍼니)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)엠레콘)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)토러스엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)미디어로그)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 라인트리엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 엠투)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)스넵쏘울)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)컴퍼니엘)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 페퍼민트픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)피터팬픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 서울독립영화제)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)에이브이에이엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)판다미디어)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 영화사 민들레)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == ㈜크래커픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 더 필름클래식 프로덕션)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 프로젝트 엠피)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)드림웨스트픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)에이씨피컴퍼니)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 크리에이티브컴즈(주))
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 양전프로덕션)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)케이앤엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 미디어소프트)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)데이드림서울)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 이상우 필름)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == ㈜월드시네마)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 야간비행)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)나우콘텐츠)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == ㈜T-JOY)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)루믹스미디어)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)씨맥스커뮤니케이션즈)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)조이앤컨텐츠그룹)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)케이알씨지)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)노이에스)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)미디어캐슬)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 스턴트코리아)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 스크린조이)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)머스트 씨 무비)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == ㈜코리아스크린)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)동아수출공사)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 도키엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)테라맥스엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 포커스 온)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == Yellow Pictures)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 익스트림 필름)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)인디플러그)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)마노엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)영진크리에이티브)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 씨네그루(주)다우기술)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 이미지팩토리)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 케이비에스미디어(주))
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)프레인글로벌)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 오퍼스픽쳐스(유))
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)수키픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)에스피엠)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 문화기획집단 영희야놀자)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)고맙습니다사랑합니다)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 세븐바이투픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 브릿지웍스 엔터테인먼트(주))
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 영화사 보라)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == C무비)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 노바엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 얼리버드)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)영화사 빅)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)에이블엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)퍼스트런)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 아이제이미디어(주))
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)미디어이야기)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == (주)더블앤조이픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(배급사 == 시네마 뉴원)
{
	res+="188648 ~ 339294\n"
}
}
else if(?감독 == 김선)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 호소다 마모루)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 유야마 쿠니히코)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 라인하드 클루스)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 호거 태프)
{
if(제작사/수입사 == (주)케이퍼필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 리얼라이즈픽쳐스(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 씨제이이앤엠 주식회사)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 한국소니픽쳐스릴리징브에나비스타영화㈜)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)영화사비단길)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 워너브러더스코리아(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)두타연)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (유)에이디사공육)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)팔레트픽처스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 쇼박스㈜미디어플렉스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)수필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 영화사 집)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)오죤필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)명필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)제이케이필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)아우라픽처스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 유니버설픽쳐스인터내셔널 코리아(유))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 영화사청어람(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)다세포클럽)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 판씨네마㈜)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)황기성 사단)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)영화제작소보임)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 영화사 무쇠팔)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 플로우식스(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 자이온이엔티(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)누리픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 히트박스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 소니픽쳐스릴리징월트디즈니스튜디오스코리아(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 이십세기폭스코리아(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)더타워픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)웰메이드스타엠)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 나의PS파트너 문화산업전문회사)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)영화사오름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)삼거리픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)판타지오)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 블루미지)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)영화사채움)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 오퍼스픽쳐스(유))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)케이앤엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)데이지엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)영화사홍)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 정지우 필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == ㈜렛츠필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)영화사울림)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)트로피엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == ㈜더드림앤드픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)주머니필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)빨간마후라)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 휠므빠말주식회사)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 영화사심미안(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)51k)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 드림웍스 애니메이션)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)드림써치C&C)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 한국교육방송공사 EBS)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 올리브스튜디오)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)태원엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)씨네이천)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)영화사아이비젼)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)기안컬처테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)씨네마골뱅이)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)나이너스엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == ㈜사람엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)스마일이엔티)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 영화사 도로시(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 라이온스 게이트 필름즈)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 김기덕 필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)조이앤컨텐츠그룹)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 유니코리아문예투자㈜)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 상상필름(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)황금주전자)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)드림캡쳐)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)에이트볼픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)필통픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)고스트픽처스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)주피터필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 롯데쇼핑㈜롯데엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)더블앤조이픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == ㈜전망좋은 영화사)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 얼리버드)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)포켓몬코리아)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == ㈜코리아스크린)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 타임스토리그룹(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 아일랜드픽처스(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 대원미디어㈜)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)오션필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 스페이스엠(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)조이앤컨텐츠그룹|(주)케이알씨지)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 마포필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)노마드필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)포커스앤컴퍼니)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == ㈜디지아트프로덕션)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 더 애니메이션 픽쳐 컴퍼니)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)조이앤컨텐츠그룹|(주)액티버스엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 필라멘트픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)부메랑모션픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)씨티엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)영화사 진진)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == KT&G 상상마당 영화사업팀 컴퍼니에스에스(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)하리마오픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)제이와이피엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)바른손)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 지오엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)무브픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)매니지먼트 숲)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)대길이에스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)영화사폴)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 씨너스엔터테인먼트(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)화인픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 연분홍 치마)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)티캐스트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)부메랑모션픽쳐스|(주)드림웨스트픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 파라마운트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 청년필름(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 한국게이인권운동단체 친구사이)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)트리니티엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 에이원엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)루믹스미디어)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)메인타이틀픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)드림웨스트픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 케이비에스미디어(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)울림엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)에스비에스콘텐츠허브)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == CNR미디어)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 구혜선 필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 제이엠지엔터테인먼트(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)에스엠엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)영화제작전원사)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)프레인글로벌|(주)드림웨스트픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)씨제스엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 찬란)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 주식회사 풍경소리)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == ㈜영화사엠16)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)온전한 컴퍼니)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)쁘리야)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == ㈜영화사 백두대간)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)인영트레이딩)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)엔브릭스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 크리에이티브 이스트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)마운틴픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 익스트림 필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 민병훈필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 제이오엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)레드로버)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 툰박스 엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)비투이)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)고맙습니다사랑합니다)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)이대희 애니메이션스튜디오)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == CGV 무비꼴라쥬)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 그린나래미디어(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 국가인권위원회)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)영화사 남원)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)영화사 조제)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)스폰지이엔티)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 뉴원시네마)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == ㈜MBC)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 씨네21아이(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == ㈜미로비젼)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 미디어소프트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)영화사 자미)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 부산경남대표방송)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 투니버스(주)온미디어|㈜크래커픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 애니박스 엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == ㈜크래커픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)인스터피씨엠)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 영화사 랑)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)아피아스튜디오)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)컴퍼니엘)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)고유에프앤)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)더줌픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 오드)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 크리스리픽쳐스인터내셔널(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)에스와이코마드)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)서태지컴퍼니)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 와이즈앤와이드엔터테인먼트(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)엣나인필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 세븐바이투픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 테디웍스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)펜타이엔씨)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)씨네365)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)키노아이디엠씨)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == ㈜플래니스 엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)시네마달)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)토러스엔터테인먼트|(주)트리니티네트워크)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 어머니 제작위원회)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)디케이미디어)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)프리비젼엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)디엔티미디어)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 서울시 교육청)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)인벤트스톤)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)보리픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 씨제이 씨지브이(CJ CGV)(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)레인보우팩토리)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (재)전주국제영화제조직위원회)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 애즈필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 얼라이브픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 경픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 데이브인터랙티브)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 가나미디어)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)인디컴미디어)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 반이다)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 스튜디오 오후출근)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 포디렉터스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == ㈜인디스토리)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 러브락컴퍼니)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 롤러코스터)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 피엠피앤컴퍼니)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 라인트리엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 다카포필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 독립프로덕션빨간눈사람)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)피터팬픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 에스비에스 바이아컴 유한회사)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)소나무픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)케빈앤컴퍼니)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 프로덕션공방)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)이든픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 스토리룸)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == LEE FILM)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)나우콘텐츠)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)트리니티네트워크)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 한국영화아카데미)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)영화사조아)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)미디어로그)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 피디픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)스테이지팩토리)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 알토미디어(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 엠투)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 엔터시네마)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)키노크러시)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)스넵쏘울)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 영화사뜰(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 키노망고스틴)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 킹레코드)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 잉스팅크티브 필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 스파이럴 프로젝트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 플라잉타이거픽처스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 페퍼민트픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 스피나치앤빈)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)동녘필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 영화제작소 다)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)노이에스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)맑음영화사)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 이홍재 필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 서울독립영화제)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)미디어캐슬)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)에이브이에이엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 보통영화사)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 필름문)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)씨타도시공간)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 영화사 민들레)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 세도나아이(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 더 필름클래식 프로덕션)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)CMG초록별)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 앤에프통상)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)에이씨피컴퍼니)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 크리에이티브컴즈(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 양전프로덕션)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 버진필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)데이드림서울)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)팔라우픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 이상우 필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == ㈜월드시네마)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 야간비행)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)케이알씨지)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 예지림엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 스턴트코리아)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 비즈니스네크워크)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 골든타이드픽처스(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 스크린조이)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)씨네라인코리아)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)사람과사람)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == ㈜크래커픽쳐스|(주)머스트 씨 무비)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)토러스엔터테인먼트|(주)엣나인필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)동아수출공사)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 도키엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)테라맥스엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 포커스 온)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 영화사히트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 영화사온난전선)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)액티버스엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)인디플러그)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)마노엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)토파즈미디어)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)영진크리에이티브)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)토러스엔터테인먼트)
{
	res+="0 ~ 3547\n"
}
else if(제작사/수입사 == 영화제작소 정감)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 주식회사 제이앤피)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 박수건달문화산업전문(유))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 굿초이스컷픽쳐스(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 씨네그루(주)다우기술)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 씨네힐)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 파라마운트 픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 이미지팩토리)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == ㈜화인웍스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)씨엘엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)오콘)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 중국오락문화투자유한회사)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 오지필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)외유내강)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 모티브 필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 디마엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)앤드플러스미디어웍스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)영화사거미)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 필름트레인)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == ㈜씨씨에스미디어)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)영화사소풍)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)수키픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 소울다큐)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 트리필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)유이케이)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 프로덕션 작품(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)사나이픽처스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 페퍼민트앤컴퍼니)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)파트너스케이)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)티피에스컴퍼니)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)애니플러스|(주)토러스엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 디 보나벤츄라 픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 광화문시네마)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)머스트 씨 무비)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 주식회사 뭉클픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 위더스필름(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)미라클필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)파워이엔티)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == ㈜게이트픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 아시아나 국제 단편 영화제)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)스푸키번치)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 케이엠컬쳐㈜)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)메인타이틀픽쳐스|영화사 마농(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 문화예술사업단 BIKI)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)뱅가드스튜디오)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 자파리필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 설문대영상)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 신현원프로덕션)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)퓨어픽쳐스인터내셔널코리아)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)캔들미디어)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)프리콤프로덕션)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 마스터 클래스의 산책 제작위원회)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 초록의 공명)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 주니파워픽처스(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 판타지웍스엔터)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 반달)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 볼)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)크리픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 이십세기폭스 인터내셔널 프로덕션)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)시네마서비스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 시네마팩토리)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 문화기획집단 영희야놀자)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == KBS 미디어)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)인앤인픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)제이엠씨미디어)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 영화사 보라)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)싸이더스에프앤에이치)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)콘텐츠게이트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == ㈜세종커뮤니케이션스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)미인픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)별의별)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 크라켄)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)진진엔터테인먼트필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 주식회사 미콘)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)에이블엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 비트윈(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 감어인 필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)홍필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)무브먼트 픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 모쿠슈라)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)엠씨엠씨)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 우성엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)유무비)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 프로덕션 LAS)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)퍼스트런)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 내일그리고오늘(주))
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == 플랜 비 엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)미디어이야기)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)프라이데이 엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)필마픽쳐스)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)라인필름)
{
	res+="188648 ~ 339294\n"
}
else if(제작사/수입사 == (주)뮤제엔터테인먼트)
{
	res+="188648 ~ 339294\n"
}
}
else if(?감독 == 허진호)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 크리스 리노드)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 카일 발다)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 오키우라 히로유키)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 조 카나한)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 정용주)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 카메론 크로우)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 마스이 소이치)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 장윤현)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 세스 맥파라인)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 캐리 주스넌)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 요르겐 레르담)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 웨인 쏜리)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 마이클 수치)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 육상효)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 드류 고다드)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 구자홍)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 배형준)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 엔리케 가토)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 이경호)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 만스 말린드)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 비욘 스테인)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 조지 밀러)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 후안 디에고 솔라나스)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 론 쉐르픽)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 쿠스바 고조)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 다니엘 에스피노사)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 크리스 고락)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 제임스 맥티그)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 필리다 로이드)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 벤 애플렉)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 마이크 맥코이)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 스콧 워)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 하나부사 츠토무)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 닐 버거)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 미셸 아자나비슈스)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 마크 네브다인)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 브라이언 테일러)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 제임스 왓킨스)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 타케모토 노보루)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 김익로)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 스티븐 스필버그)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 김지운)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 임필성)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 이근우)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 이인항)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 윤학렬)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 줄리앙 마그넷)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 마브룩 엘 메크리)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 아담 쉥크만)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 토마스 알프레드슨)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 순리준)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 미야오 요시카즈)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 조림산)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 존 굴러거)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 김일란)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 홍지유)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 올 파커)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 더글라스 맥그래스)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 사라 폴리)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 존 힐코트)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 마틴 스콜세지)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 나가이시 다카오)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 스티븐 소더버그)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 아리엘 슐만)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 헨리 유스트)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 스콧 데릭슨)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 존 매든)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 알렉산더 페인)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 발타자르 코루마쿠르)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 켄 콰피스)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 김조광수)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 매티스 반 헤이닌겐 주니어)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 제임스 완)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 로드리고 코르테스)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 피트 트래비스)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 곽경택)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 타케우치 요시오)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 조지 클루니)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 린 램지)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 로저 도날드슨)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 이나 예블라니코바)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 스비야토슬라브 우샤코프)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 아몰 굽트)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 파스칼 쇼메유)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 손석)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 맥스 기와)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 다니아 파스퀴니)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 더 비셔우스 브라더스)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 정재은)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 브라이언 클러그만)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 리 스턴탈)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 구파도)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 구혜선)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 마커스 니스펠)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 최진성)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 다비드 포앙키노스)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 스테판 포엔키노스)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 홍상수)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 데클란 도넬란)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 닉 오머로드)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 로버트 로렌즈)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 데이빗 크로넨버그)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 제시 페레츠)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 마크 포스터)
{
if(배급사 == 쇼박스㈜미디어플렉스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 씨제이이앤엠 주식회사)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 한국소니픽쳐스릴리징브에나비스타영화㈜)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 워너브러더스코리아(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)넥스트엔터테인먼트월드(NEW))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 롯데쇼핑㈜롯데엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 유니버설픽쳐스인터내셔널 코리아(유))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)인벤트스톤)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 영화사청어람(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 필라멘트픽쳐스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 소니픽쳐스릴리징월트디즈니스튜디오스코리아(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 이십세기폭스코리아(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 씨너스엔터테인먼트(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 타임스토리그룹(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)시너지하우스 (시너지))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)에스비에스콘텐츠허브)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)스마일이엔티)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)나이너스엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)엣나인필름)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)미디어데이)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)팝파트너스)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)화앤담이엔티)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)시네마서비스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)싸이더스에프앤에이치)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == KT&G 상상마당 영화사업팀 컴퍼니에스에스(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 팝엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)영화사 진진)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)마인스 엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 에이원엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)시네마달)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)티캐스트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 예지림엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 골든타이드픽처스(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 판씨네마㈜)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)팝엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)두타연)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == ㈜미로비젼)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)영화제작전원사)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)영화사 조제)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 롯데쇼핑㈜롯데시네마)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 찬란)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == ㈜영화사 백두대간)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)영화사조아)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)마운틴픽쳐스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)명필름)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 스튜디오느림보)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == ㈜인디스토리)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == CGV 무비꼴라쥬)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 그린나래미디어(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 뉴원시네마)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 씨네21아이(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)데이지엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)프리비젼엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)인스터피씨엠)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)스크린와이즈)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)키노아이디엠씨)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 오드)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)에스와이코마드)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)서태지컴퍼니)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)화인픽쳐스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 씨제이 씨지브이(CJ CGV)(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (재)전주국제영화제조직위원회)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 데이브인터랙티브)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 시네마달)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)누리픽쳐스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 롤러코스터)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 어뮤즈)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)액티버스엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)소나무픽쳐스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)영화사폴)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)케빈앤컴퍼니)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)엠레콘)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)토러스엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)미디어로그)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 라인트리엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 엠투)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)스넵쏘울)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)컴퍼니엘)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 페퍼민트픽쳐스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)피터팬픽쳐스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 서울독립영화제)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)에이브이에이엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)판다미디어)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 영화사 민들레)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == ㈜크래커픽쳐스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 더 필름클래식 프로덕션)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 프로젝트 엠피)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)드림웨스트픽쳐스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)에이씨피컴퍼니)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 크리에이티브컴즈(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 양전프로덕션)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)케이앤엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 미디어소프트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)데이드림서울)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 이상우 필름)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == ㈜월드시네마)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 야간비행)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)나우콘텐츠)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == ㈜T-JOY)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)루믹스미디어)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)씨맥스커뮤니케이션즈)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)조이앤컨텐츠그룹)
{
	res+="0 ~ 3547\n"
}
else if(배급사 == (주)케이알씨지)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)노이에스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)미디어캐슬)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 스턴트코리아)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 스크린조이)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)머스트 씨 무비)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == ㈜코리아스크린)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)동아수출공사)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 도키엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)테라맥스엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 포커스 온)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == Yellow Pictures)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 익스트림 필름)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)인디플러그)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)마노엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)영진크리에이티브)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 씨네그루(주)다우기술)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 이미지팩토리)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 케이비에스미디어(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)프레인글로벌)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 오퍼스픽쳐스(유))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)수키픽쳐스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)에스피엠)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 문화기획집단 영희야놀자)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)고맙습니다사랑합니다)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 세븐바이투픽쳐스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 브릿지웍스 엔터테인먼트(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 영화사 보라)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == C무비)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 노바엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 얼리버드)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)영화사 빅)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)에이블엔터테인먼트)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)퍼스트런)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 아이제이미디어(주))
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)미디어이야기)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == (주)더블앤조이픽쳐스)
{
	res+="3240545 ~ 5644069\n"
}
else if(배급사 == 시네마 뉴원)
{
	res+="3240545 ~ 5644069\n"
}
}
else if(?감독 == 줄리 앤 로빈슨)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 타니구치 고로)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 미카엘 하네케)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 백창주)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 장 피에르 다르덴)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 뤽 다르덴)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 안드리아 아놀드)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 존 스톡웰)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 조병옥)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 김문흠)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 김태균)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 아미르 칸)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 가렛 에반스)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 빔 벤더스)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 말릭 벤젠룰)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 마이클 화이트)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 로만 폴란스키)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 올리버 스톤)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 신동엽)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 사이먼 커티스)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 이승준)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 천정훈)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 라스 폰 트리에)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 자비에 보브와)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 민병훈)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 조정래)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 비자이)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 윌리엄 모나한)
{
if(개봉 계절 == 여름)
{
	res+="3547 ~ 64195\n"
}
else if(개봉 계절 == 가을)
{
	res+="3547 ~ 64195\n"
}
else if(개봉 계절 == 봄)
{
	res+="3547 ~ 64195\n"
}
else if(개봉 계절 == 겨울)
{
	res+="0 ~ 3547\n"
}
}
else if(?감독 == 존 허위츠)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 헤이든 쉬로스버그)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 피터 레페니오티스)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 데렉 시앤프랭스)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 페르난도 트루에바)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 하비에르 마리스칼)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 토노 에란도)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 김재환)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 마크 톤데라이)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 사토 히로유키)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 주현량)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 이대희)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 뤽 베송)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 카를로 미라벨라 데이비스)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 크리스 답킨스)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 닉 어거스트 페르나)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 헨닝 칼슨)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 브루스 로빈슨)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 우슬라 마이어)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 강이관)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 조성규)
{
if(배급사 == 쇼박스㈜미디어플렉스)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 씨제이이앤엠 주식회사)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 한국소니픽쳐스릴리징브에나비스타영화㈜)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 워너브러더스코리아(주))
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)넥스트엔터테인먼트월드(NEW))
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 롯데쇼핑㈜롯데엔터테인먼트)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 유니버설픽쳐스인터내셔널 코리아(유))
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)인벤트스톤)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 영화사청어람(주))
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 필라멘트픽쳐스)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 소니픽쳐스릴리징월트디즈니스튜디오스코리아(주))
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 이십세기폭스코리아(주))
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 씨너스엔터테인먼트(주))
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 타임스토리그룹(주))
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)시너지하우스 (시너지))
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)에스비에스콘텐츠허브)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)스마일이엔티)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)나이너스엔터테인먼트)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)엣나인필름)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)미디어데이)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)팝파트너스)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)화앤담이엔티)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)시네마서비스)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)싸이더스에프앤에이치)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == KT&G 상상마당 영화사업팀 컴퍼니에스에스(주))
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 팝엔터테인먼트)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)영화사 진진)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)마인스 엔터테인먼트)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 에이원엔터테인먼트)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)시네마달)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)티캐스트)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 예지림엔터테인먼트)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 골든타이드픽처스(주))
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 판씨네마㈜)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)팝엔터테인먼트)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)두타연)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == ㈜미로비젼)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)영화제작전원사)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)영화사 조제)
{
	res+="0 ~ 3547\n"
}
else if(배급사 == 롯데쇼핑㈜롯데시네마)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 찬란)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == ㈜영화사 백두대간)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)영화사조아)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)마운틴픽쳐스)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)명필름)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 스튜디오느림보)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == ㈜인디스토리)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == CGV 무비꼴라쥬)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 그린나래미디어(주))
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 뉴원시네마)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 씨네21아이(주))
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)데이지엔터테인먼트)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)프리비젼엔터테인먼트)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)인스터피씨엠)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)스크린와이즈)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)키노아이디엠씨)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 오드)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)에스와이코마드)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)서태지컴퍼니)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)화인픽쳐스)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 씨제이 씨지브이(CJ CGV)(주))
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (재)전주국제영화제조직위원회)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 데이브인터랙티브)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 시네마달)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)누리픽쳐스)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 롤러코스터)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 어뮤즈)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)액티버스엔터테인먼트)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)소나무픽쳐스)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)영화사폴)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)케빈앤컴퍼니)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)엠레콘)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)토러스엔터테인먼트)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)미디어로그)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 라인트리엔터테인먼트)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 엠투)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)스넵쏘울)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)컴퍼니엘)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 페퍼민트픽쳐스)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)피터팬픽쳐스)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 서울독립영화제)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)에이브이에이엔터테인먼트)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)판다미디어)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 영화사 민들레)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == ㈜크래커픽쳐스)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 더 필름클래식 프로덕션)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 프로젝트 엠피)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)드림웨스트픽쳐스)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)에이씨피컴퍼니)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 크리에이티브컴즈(주))
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 양전프로덕션)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)케이앤엔터테인먼트)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 미디어소프트)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)데이드림서울)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 이상우 필름)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == ㈜월드시네마)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 야간비행)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)나우콘텐츠)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == ㈜T-JOY)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)루믹스미디어)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)씨맥스커뮤니케이션즈)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)조이앤컨텐츠그룹)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)케이알씨지)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)노이에스)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)미디어캐슬)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 스턴트코리아)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 스크린조이)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)머스트 씨 무비)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == ㈜코리아스크린)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)동아수출공사)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 도키엔터테인먼트)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)테라맥스엔터테인먼트)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 포커스 온)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == Yellow Pictures)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 익스트림 필름)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)인디플러그)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)마노엔터테인먼트)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)영진크리에이티브)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 씨네그루(주)다우기술)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 이미지팩토리)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 케이비에스미디어(주))
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)프레인글로벌)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 오퍼스픽쳐스(유))
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)수키픽쳐스)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)에스피엠)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 문화기획집단 영희야놀자)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)고맙습니다사랑합니다)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 세븐바이투픽쳐스)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 브릿지웍스 엔터테인먼트(주))
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 영화사 보라)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == C무비)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 노바엔터테인먼트)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 얼리버드)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)영화사 빅)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)에이블엔터테인먼트)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)퍼스트런)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 아이제이미디어(주))
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)미디어이야기)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == (주)더블앤조이픽쳐스)
{
	res+="3547 ~ 64195\n"
}
else if(배급사 == 시네마 뉴원)
{
	res+="3547 ~ 64195\n"
}
}
else if(?감독 == 클라우스 해로)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 김진만)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 김재영)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 미시마 유키코)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 겔라 바블루아니)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 미셸 오슬로)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 데이비드 에이어)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 스기노 아키오)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 후미히로 요시무라)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 톰 맥카시)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 케빈 맥도널드)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 허안화)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 미란다 줄리)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 리처드 J. 루이스)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 오기가미 나오코)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 닉 스트링거)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 패디 콘시딘)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 마미 스나다)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 진재운)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 티모 부오렌솔라)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 후지모리 마사야)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 베스 카그맨)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 미타니 코키)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 무라타 마사히코)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 사부)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 매튜 본)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 브렛 설리반)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 사이몬 필립스)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 페오 알라다그)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 사나다 아츠시)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 김성훈)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 진광교)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 세드릭 칸)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 제이크 스코트)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 최종태)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 로코 파팔레오)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 구스타보 론)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 사이러스 노라스테)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 크리스티앙 문쥬)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 서태지)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 켄 스콧)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 마우고시카 슈모프스카)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 장 피에르 주네)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 조디 포스터)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 야누스 메츠 패더슨)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 타니아 웩슬러)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 임태형)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 파스칼 포자두)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 제롬 데스챔프)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 파스칼 헤롤드)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 마차 마케이에프)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 니콜라이 아르셀)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 장 마크 발레)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 하라 케이이치)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 린 타로)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 이송희일)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 로렌스 코너)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 로버트 B. 웨이드)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 마이클 브랜트)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 데이빗 M. 로젠탈)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 태준식)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 알렉산드르 소쿠로브)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 김형렬)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 파올로 소렌티노)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 멜라니 로랑)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == S. 샹카르)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 무라타 카즈야)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 박흥식)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이광국)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 수유 린)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 리차드 켈리)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 스티븐 실버)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 아이라 잭스)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 루나 루나슨)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 크리스 웨이츠)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 닐스 아르덴 오플레브)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 알랭 레네)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 요시노 히로시)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 마르탱 프로보스트)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 데이빗 홀랜더)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 잉마르 베리만)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 벨라 타르)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 신아가)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이상철)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 김경묵)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 안나 저스티스)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 유형)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 존 건)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 다카하시 반메이)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 히시다 마사카즈)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 사사가와 히로시)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이상우)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 지민)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 아미르 나데리)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 야마시타 노부히로)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 루카 미니에로)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 게레온 베첼)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 다니엘 알프레드슨)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 신수원)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이수연)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 김성호)
{
if(배급사 == 쇼박스㈜미디어플렉스)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 씨제이이앤엠 주식회사)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 한국소니픽쳐스릴리징브에나비스타영화㈜)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 워너브러더스코리아(주))
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)넥스트엔터테인먼트월드(NEW))
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 롯데쇼핑㈜롯데엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 유니버설픽쳐스인터내셔널 코리아(유))
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)인벤트스톤)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 영화사청어람(주))
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 필라멘트픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 소니픽쳐스릴리징월트디즈니스튜디오스코리아(주))
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 이십세기폭스코리아(주))
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 씨너스엔터테인먼트(주))
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 타임스토리그룹(주))
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)시너지하우스 (시너지))
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)에스비에스콘텐츠허브)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)스마일이엔티)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)나이너스엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)엣나인필름)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)미디어데이)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)팝파트너스)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)화앤담이엔티)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)시네마서비스)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)싸이더스에프앤에이치)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == KT&G 상상마당 영화사업팀 컴퍼니에스에스(주))
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 팝엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)영화사 진진)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)마인스 엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 에이원엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)시네마달)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)티캐스트)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 예지림엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 골든타이드픽처스(주))
{
	res+="0 ~ 3547\n"
}
else if(배급사 == 판씨네마㈜)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)팝엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)두타연)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == ㈜미로비젼)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)영화제작전원사)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)영화사 조제)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 롯데쇼핑㈜롯데시네마)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 찬란)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == ㈜영화사 백두대간)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)영화사조아)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)마운틴픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)명필름)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 스튜디오느림보)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == ㈜인디스토리)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == CGV 무비꼴라쥬)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 그린나래미디어(주))
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 뉴원시네마)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 씨네21아이(주))
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)데이지엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)프리비젼엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)인스터피씨엠)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)스크린와이즈)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)키노아이디엠씨)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 오드)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)에스와이코마드)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)서태지컴퍼니)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)화인픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 씨제이 씨지브이(CJ CGV)(주))
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (재)전주국제영화제조직위원회)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 데이브인터랙티브)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 시네마달)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)누리픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 롤러코스터)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 어뮤즈)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)액티버스엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)소나무픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)영화사폴)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)케빈앤컴퍼니)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)엠레콘)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)토러스엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)미디어로그)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 라인트리엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 엠투)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)스넵쏘울)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)컴퍼니엘)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 페퍼민트픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)피터팬픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 서울독립영화제)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)에이브이에이엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)판다미디어)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 영화사 민들레)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == ㈜크래커픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 더 필름클래식 프로덕션)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 프로젝트 엠피)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)드림웨스트픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)에이씨피컴퍼니)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 크리에이티브컴즈(주))
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 양전프로덕션)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)케이앤엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 미디어소프트)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)데이드림서울)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 이상우 필름)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == ㈜월드시네마)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 야간비행)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)나우콘텐츠)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == ㈜T-JOY)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)루믹스미디어)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)씨맥스커뮤니케이션즈)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)조이앤컨텐츠그룹)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)케이알씨지)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)노이에스)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)미디어캐슬)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 스턴트코리아)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 스크린조이)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)머스트 씨 무비)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == ㈜코리아스크린)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)동아수출공사)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 도키엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)테라맥스엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 포커스 온)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == Yellow Pictures)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 익스트림 필름)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)인디플러그)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)마노엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)영진크리에이티브)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 씨네그루(주)다우기술)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 이미지팩토리)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 케이비에스미디어(주))
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)프레인글로벌)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 오퍼스픽쳐스(유))
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)수키픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)에스피엠)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 문화기획집단 영희야놀자)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)고맙습니다사랑합니다)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 세븐바이투픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 브릿지웍스 엔터테인먼트(주))
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 영화사 보라)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == C무비)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 노바엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 얼리버드)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)영화사 빅)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)에이블엔터테인먼트)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)퍼스트런)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 아이제이미디어(주))
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)미디어이야기)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == (주)더블앤조이픽쳐스)
{
	res+="339294 ~ 615783\n"
}
else if(배급사 == 시네마 뉴원)
{
	res+="339294 ~ 615783\n"
}
}
else if(?감독 == 호리키리조노 켄타로)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 파울 슈마츠니)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 리 위)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 데이빗 겔브)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 백승화)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 서극)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 한지원)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 찰리 프리드릭스)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 발레리 게르기예프)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 베르트랑 보넬로)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 정대건)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 경순)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 시나가와 히로시)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 크리스티안 히메네즈)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 오키타 슈이치)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 베네덱 플리고프)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 알렉스 드 라 이글레시아)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 유호진)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 존 하이암즈)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 베노이트 필립폰)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 마티유 아말릭)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 김희정)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 송일곤)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 우다 고노스케)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 호요휘)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 다니엘 아르비드)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 안드리스 넬슨스)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 백연아)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 제임스 보빈)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 마이클 그랑디지)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 임진순)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이수성)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 강문)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 릭 비버)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 데틀레프 북)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 양정호)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 히가시 요이치)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 윌리 데커)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 크리스티안 E.크리스티안센)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 줄리 베르토첼리)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 배광수)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 정보서)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 플로렝 에밀리오 시리)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 구상범)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 데스 맥가너프)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 데이빗 맥킨지)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 치로 카펠라리)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이상빈)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 프레데릭 와이즈만)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 장-루프 펠리시올리)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 알랭 가뇰)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이정황)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 허철)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 강효진)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 봉만대)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 오영두)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 자비에 장)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 공귀현)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 조르고스 란시모스)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 박루슬란)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이마카케 이사무)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 댄 러쉬)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 저스틴 채드윅)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 지하진)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 도미니크 아벨)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 피오나 고든)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 브루노 로미)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 야니케 시스타드 야콥슨)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 랜스 데일리)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 전수일)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 안토니오 니그렛)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 린 유시엔)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이수정)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 유승택)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 수오 마사유키)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 빅터 플레밍)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 그레이엄 빅)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 한상희)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 안철호)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이홍재)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 민두식)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 카트린느 브레이야)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 트리스탄 바우에르)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 제임스 마쉬)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 부지영)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 김꽃비)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 서영주)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 양은용)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 로랑 펠리)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 하워드 베이커)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 오토모 가츠히로)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 오카무라 텐사이)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 모리모토 코지)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 버나드 로즈)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 데이비드 멕비카)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 소노 시온)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 스티븐 워즈워스)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 로베르트 르빠쥬)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 송예섭)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 에릭 바레트)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 최용석)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 어일선)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 피에그 루이기 사마라타니)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이네 살림)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 박광춘)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 올레 쉘)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 사라 지프)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 양백견)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 도미니크 몽페리)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 스테판 리보자드)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 박영철)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 김중현)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 팰림 맥더모트)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 김건)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 구스타보 헤르난데즈)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이주헌)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 호베흐또 가흐제이휴)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 최영석)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 브래드 T. 갓프레드)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 전화성)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 김기현)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 조성형)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 하스미 에이이치로)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 인진미)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 미이케 다카시)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 박성수)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 김선아)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 박세희)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 카를로스 레이가다스)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 월리엄 크리스티)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 박준범)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이마오카 신지)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 요시다 코우다)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 타케키요 히토시)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이세야 유스케)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 마누엘 카르발로)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 마에노 토모야)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 토마스 하우엘)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이숭환)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 히로타 미키오)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 마크 앳킨스)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 에릭 델라바레)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 토니 크란츠)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 마이크 건서)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 브라이언 에이브릴)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 피터 도드)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 조슈아 세프텔)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 다리오 아르젠토)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 로버트 리버맨)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 루퍼트 브라이언)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 맥스 매닉스)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 데이빗 미코드)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 마이클 호프만 Jr.)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 아론 T. 웰즈)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 자비에 팔뤼)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 반원량)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 조 쉐인)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 전국위)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 고명안)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 제이크 케네디)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 타지리 유지)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 쿄우야 타다시)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 헬렌 헌트)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이세일)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 에릭 이스튼버그)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 에노모토 토시로)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 신혜성)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 조조 히데오 / 죠죠 히데오)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 후지와라 켄이치)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 토모마치 나오유키)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 오카모토 후토시)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 아라키 겐지)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 코우야 타다시)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 쉐인 반 다이크)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 아리얼 브로멘)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 카타오카 슈지)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 카모가와 테츠로)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 백상열)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 프레드 카바예)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 레니 할린)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 위트 스틸먼)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 에두아르드 코르테스)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 진훈기)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 임초현)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == K. 애셔 레빈)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 박선욱)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 코바야시 츠네오)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 진가상)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 타라 퍼니아)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 파르한 악타르)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 에릭 포스버그)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 뎁 헤이갠)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 앙토니 코르디에)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 에릭 베스나드)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 미초 루타르)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 사이몬 엘리스)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 짐 믹클)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 토모마츠 나오유키)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 미미 레더)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 댄 가르시아)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 제이다 핀켓 스미스)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 안토니오 자발라 쿠글러)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 브누와 쟉꼬)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 크리스 무어)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 하갈 벤 애셔)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이케다 치히로)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 쿠보데라 카즈토)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 아이조메 쿄코)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 고바야시 코지)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 필국지)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 모리오카 토시유키)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이시카와 킨)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이즈치 키슈)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 노무라 카즈야)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 전문기)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 알랭 기로디)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 카와무라 키요토)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 쿠로사기 히로시)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 메리 램버트)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 크리스토퍼 레이)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 나카마치 사쿠)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 호라이 타다아키)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 가타오카 슈지)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 시디끄)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 라울 루이즈)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 예스퍼 묄러)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 지넴 사카오글루)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 헬머 피셔)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 요시다 료코)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 렌조 마르티넬리)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 요코야마 카즈히로)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 조조 히데오)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 교우야 타다시)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 타카하라 히데카즈)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이사카와 히토시)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 칸바라 이구토)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 와타베 세이치)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 마츠우라 마사코)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 김춘찬)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 유호 히토시)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 장 클로드 브리소)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 고락중)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 마이클 래드포드)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 와타나베 타카후미)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 크리스토퍼 로빈 콜린스)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이시오카 마사토)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 카나자와 카츠지)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 미구엘 엔젤 비바스)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 황명승)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 카를레스 토라스)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 스티븐 R. 몬로)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 구아타보 니에토 로아)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 모우리 요이치)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 줄리앙 카본)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 로랑 코티오드)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 진목승)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 제제 다카히사)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 사토 토시기)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 요시 새슨)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 사노 가즈히로)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 스즈키 토시히사)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 우에노 토시야)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 사노 카즈히로)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 후쿠오카 요시호)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 사토 히사야스)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 제이민)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 프란트 궈)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 양 리)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 호르모즈)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 허재형)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 안드레이 콘찰로프스키)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 수잔 비에르)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == J.C 챈더)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 토니 골드윈)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 오오토모 케이시)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이원식)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 후지와라 타카시)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 조진규)
{
	res+="3240545 ~ 5644069\n"
}
else if(?감독 == 앤디 워쇼스키)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 라나 워쇼스키)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 톰 튀크베어)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 다카하타 이사오)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 마크 A.Z. 디페)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 베르너 헤어조크)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 리 다니엘스)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 로버트 로드리게즈)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 에릭 매닝)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 키오니 왁스먼)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 겐디 타르타코프스키)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 크리스토퍼 맥쿼리)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 후안 안토니오 바요나)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 벤 루윈)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 제이크 슈레이어)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 이시바시 요시마사)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 박철수)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 박보상)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 데미안 코졸레)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 울프 시르머)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 알렉산드르 블라브스키)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이환경)
{
	res+="11376139 ~\n"
}
else if(?감독 == 박영균)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 앤드레스 무시에티)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 스테판 루조비츠키)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 기욤 이베르넬)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 아르튀르 크왁)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 토마스 빈터베르그)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 니쉬칸트 카마트)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 박배일)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 나가미네 마사토시)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 류승완)
{
	res+="5644069 ~ 11376139\n"
}
else if(?감독 == 스기이 기사부로)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 쿠엔틴 리)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 제니퍼 챔버스 린치)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 웨스 앤더슨)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 말콤 벤빌)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 류신의)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 다니엘 그로우)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이윤형)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 박홍민)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 제이 챈드라세카)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 모토키 타카시)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 리차드 이어)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 존 무어)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 임순례)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 블라드 바르베)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 막심 스베쉬니코브)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 샘 펠)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 크리스 버틀러)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 야노 히로유키)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 벤 제틀린)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 양야체)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 첸 카이거)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 샤그다슈렌)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이원석)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 토미 위르콜라)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 얀 리벡)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 데이빗 O. 러셀)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 레미 베잔송)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 장-클리스토페 리에)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 크리스토프 오노레)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 이정호)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 전규환)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 파라 칸)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 시오타니 나오요시)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 마이클 라이트)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 장 폴 살로메)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 페데리코 모시아)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 펫챠이 왕캄라오)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 마르코스 에프론)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 박훈정)
{
	res+="3240545 ~ 5644069\n"
}
else if(?감독 == 닉힐 아드바니)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 박명랑)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 프라파스 콜사라논)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 하야토 다테)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 김태곤)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 데이빗 바렛)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 다인 사이드)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이시카와 히토시)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 타나다 유키)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 마틴 허버티)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 성룡)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 브라이언 싱어)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 박찬욱)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 토니 탕)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 로버트 제멕키스)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 이재용)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 요네타니 요시토모)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 폴 사피아노)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 에릭 제노비스)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 황조권)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 프라챠 핀카엡)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 아순 마와르디)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 돈 로이 킹)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 조쉬 스텐펠드)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 라이언 리틀)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 루 비질)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 재키 카투)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 권호영)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 샘 레이미)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 캐서린 비글로우)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 양영희)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 김동호)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이현철)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 강호준)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 김진희)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 황희성)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 서용호)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 문인대)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이정원)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 김두헌)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 빌 코코란)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 윌리엄 프리드킨)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 바틀렛 쉐어)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 조지 토레그로사)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 다나 아담 사피로)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 제프 첼렌타노)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 윤종찬)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 조나단 레빈)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 이기니오 스트라피)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 롭 코헨)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 장영치)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 알렉산드르 야킴추크)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 엘레나 코발레바)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 장희철)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이사무엘)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 데니스 토도로빅)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 칸 테츠)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 김승현)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 코디 자렛)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 사토우 토시키)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 엘리스 로버트슨)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 롭 민코프)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 파코 플라자)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 노덕)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 쿠엔틴 타란티노)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 조 라이트)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 오멸)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 나가미네 타츠야)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 에두와르도 슐츠)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 신현원)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 올리비에 다한)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 크리스티안 펫졸드)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이두용)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이장호)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 오렌 캐플란)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 알렉산드르 멜닉)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 타일러 페리)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 존 추)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 장 피에르 아메리스)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 제이슨 무어)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 더스틴 호프만)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 지율)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 루 추안)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 데릭 브룸)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 로저 호킨스)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 미야지 마사유키)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 진형태)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 장 뤽 고다르)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 세베 쉘레쯔)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 존 도일)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 케빈 카러웨이)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 마이클 A. 니클즈)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 임흥순)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 조동오)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 데이비드 프랑켈)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 앤드류 니콜)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 레오 까락스)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 알렌 휴즈)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 앤드류 도미닉)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 호리우치 히로시)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == R. 엘리스 프레이저)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 강우석)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 조셉 코신스키)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 라스무스 A. 실버르센)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 스티븐 크보스키)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 쿠보오카 토시유키)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 제이콥 아론 에스테스)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 아그네츠카 홀랜드)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 오쿠 와타루)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 마크 얼바움)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 엘리시아 모신스키)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 루크 본디)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 아이바 토모아키)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 폴 앤드류 윌리엄스)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 최승호)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 리차드 라그라브네스)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 에란 크리비)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 이지승)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 제프 니콜스)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 김혜정)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 표만석)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 양 쉬우펭)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 마크 골드스타인)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 오츠카 유키)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 마크 만)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 더글라스 아니오코스키)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 나수요)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 와타나베 세이키)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 쉐인 블랙)
{
	res+="5644069 ~ 11376139\n"
}
else if(?감독 == 엔조 달로)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 안노 히데아키)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 키타가와 에리코)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 파웰 포리코브스키)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 론 스캘펠로)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이종필)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 아미노 테츠로)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 마이크 마우루스)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 토마스 보덴스타인)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 안톤 메거딕체브)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 카와노 고우시)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 자크 오디아르)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 마커스 던스탠)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 파올로 타비아니)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 비토리오 타비아니)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 난니 모레티)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 우인태)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 엘렌 스미트)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 데이빗 브룩크너)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 글렌 맥퀘이드)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 조 스완버그)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 라디오 사일런스)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 티 웨스트)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 아담 윈가드)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 파우스토 브리찌)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 로버트 포스터)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 송해성)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 릭 로만 워프)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 스티브 맥퀸)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 필리프 팔라도)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 아딧탸 초프라)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 카미야마 켄지)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 니나가와 미카)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 메건 그리피스)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 정근섭)
{
	res+="1888876 ~ 3240545\n"
}
else if(?감독 == 바즈 루어만)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 커크 드 미코)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 크리스 샌더스)
{
	res+="615783 ~ 1108072\n"
}
else if(?감독 == 정익환)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 켄 로치)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 강진아)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 첸  진)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 시시도 준)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 마이클 슐츠)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 로젤린 보쉬)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 진승현)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 러셀 멀케이)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 크리스토퍼 N 로우리)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 콘래드 잭슨)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 칸치쿠 유리)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이동승)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 모리시타 코조)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 로베르 르빠쥬)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 저스틴 린)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 리차드 링클레이터)
{
	res+="188648 ~ 339294\n"
}
else if(?감독 == 레지스 르왕사르)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 존 랜디스)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 사토 케이이치)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 이창재)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 강석필)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 데이빗 A. 암스트롱)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 크리스토퍼 애슐리)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 마이클 페이퍼)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 하우메 발라게로)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 카사기 노조무)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 표도르 본다르추크)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == J.J. 에이브럼스)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == M. 나이트 샤말란)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 남택수)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 다니엘 코헨)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 댄 마저)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 샤샤 하트만)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 올리버 파커)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 장건재)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 크리스 크라우스)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 에두아르도 로드리게즈)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 사수가 사스케)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 얀 흐레베이크)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 장철수)
{
	res+="5644069 ~ 11376139\n"
}
else if(?감독 == 안톤 후쿠아)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 이와사키 토모코)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 카스퍼 바포드)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 코너 맥퍼슨)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 피셔 스티븐스)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 유지태)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 정하린)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 버나비 사우스콤)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 레이몽 드파르동)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 클로딘 누가레)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 조우 사다오)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 장 피에로 포넬)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 스티븐 C. 밀러)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 조나단 글렌드닝)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 잭 스나이더)
{
	res+="1888876 ~ 3240545\n"
}
else if(?감독 == 빌 어거스트)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 마이클 윈터바텀)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 야마다 나오코)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 브래드 실버링)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 에히디오 코치미글리오)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 진국부)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 고군서)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 리 타마호리)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 요르그 일레)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 토비아스 폴크)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 프레드 쉐피시)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 토머스 딕슨)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 애비 루트라)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 낸시 사보카)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 하바라 노부유시)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 브래드 앤더슨)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 에스벤 토프트 야콥슨)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 김성홍)
{
	res+="64195 ~ 188648\n"
}
else if(?감독 == 권영락)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 오기환)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 마르잔 사트라피)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 뱅상 파로노)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 리처드 링클레이터)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 리자 랑세트)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 스티브 바커)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 올리비에 마르셸)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 신조 타케히코)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 야구치 시노부)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 던컨 워드)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 마리아 린드버그)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 박병환)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 스콧 휠러)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 레나르드 프리츠 크라빙켈)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 에이케이쥐)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 미노리카와 오사무)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 히암 압바스)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 김용균)
{
	res+="1108072 ~ 1888876\n"
}
else if(?감독 == 롤랜드 에머리히)
{
	res+="339294 ~ 615783\n"
}
else if(?감독 == 저스틴 잭햄)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 에드 게스-도넬리)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 랄프 후에트너)
{
	res+="3547 ~ 64195\n"
}
else if(?감독 == 사토 유조)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 구예도)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 레이노앗 오얼레만스)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 파트리스 르꽁트)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 알렉스 그레고리)
{
	res+="0 ~ 3547\n"
}
else if(?감독 == 피터 휴익)
{
	res+="0 ~ 3547\n"
}