using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace MoveMove.Rules
{
    class Covering
    {
        static public string get(string 감독, string 계절, string 제작사, string 장르, string 관람등급, string 배급사)
        {
            string res = "";
            if (감독 == "민규동"
                && 계절 == "여름"
                && 관람등급 == "15세이상관람가")
                res += "339294 ~ 615783\n";
            if (감독 == "추창민")
                res += "11376139 ~\n";
            if (감독 == "이환경")
                res += "11376139 ~\n";
            if (감독 == "최동훈")
                res += "11376139 ~\n";
            if (감독 == "크리스토퍼 놀란")
                res += "5644069 ~ 11376139\n";
            if (감독 == "쉐인 블랙")
                res += "5644069 ~ 11376139\n";
            if (감독 == "장철수")
                res += "5644069 ~ 11376139\n";
            if (감독 == "조스 웨던")
                res += "5644069 ~ 11376139\n";
            if (감독 == "류승완")
                res += "5644069 ~ 11376139\n";
            if (감독 == "조성희"
            && 계절 == "가을")
                res += "5644069 ~ 11376139\n";
            if (감독 == "박훈정")
                res += "3240545 ~ 5644069\n";
            if (제작사 == "플랜 비 엔터테인먼트")
                res += "3240545 ~ 5644069\n";
            if (감독 == "김주호")
                res += "3240545 ~ 5644069\n";
            if (감독 == "윤종빈")
                res += "3240545 ~ 5644069\n";
            if (감독 == "이석훈")
                res += "3240545 ~ 5644069\n";
            if (감독 == "베리 소넨필드")
                res += "3240545 ~ 5644069\n";
            if (감독 == "조진규")
                res += "3240545 ~ 5644069\n";
            if (감독 == "박정우")
                res += "3240545 ~ 5644069\n";
            if (감독 == "이용주")
                res += "3240545 ~ 5644069\n";
            if (제작사 == "영화사 집")
                res += "3240545 ~ 5644069\n";
            if (감독 == "마크 웹")
                res += "3240545 ~ 5644069\n";
            if (감독 == "마크 포스터"
            && 제작사 == "롯데쇼핑㈜롯데엔터테인먼트")
                res += "3240545 ~ 5644069\n";
            if (감독 == "정지영"
            && 배급사 == "(주)넥스트엔터테인먼트월드(NEW)")
                res += "3240545 ~ 5644069\n";
            if (감독 == "민규동"
            && 배급사 == "(주)넥스트엔터테인먼트월드(NEW)")
                res += "3240545 ~ 5644069\n";
            if (감독 == "조근현")
                res += "1888876 ~ 3240545\n";
            if (감독 == "정병길")
                res += "1888876 ~ 3240545\n";
            if (감독 == "크리스 밀러")
                res += "1888876 ~ 3240545\n";
            if (감독 == "빌 콘돈")
                res += "1888876 ~ 3240545\n";
            if (감독 == "올리비에 메가톤")
                res += "1888876 ~ 3240545\n";
            if (감독 == "김대승")
                res += "1888876 ~ 3240545\n";
            if (감독 == "피터 잭슨")
                res += "1888876 ~ 3240545\n";
            if (감독 == "피터 버그")
                res += "1888876 ~ 3240545\n";
            if (감독 == "김지훈")
                res += "1888876 ~ 3240545\n";
            if (감독 == "톰 후퍼")
                res += "1888876 ~ 3240545\n";
            if (감독 == "변영주")
                res += "1888876 ~ 3240545\n";
            if (감독 == "샘 멘데스")
                res += "1888876 ~ 3240545\n";
            if (감독 == "정근섭")
                res += "1888876 ~ 3240545\n";
            if (감독 == "잭 스나이더")
                res += "1888876 ~ 3240545\n";
            if (제작사 == "영화사 무쇠팔")
                res += "1888876 ~ 3240545\n";
            if (제작사 == "플로우식스(주)")
                res += "1888876 ~ 3240545\n";
            if (제작사 == "자이온이엔티(주)")
                res += "1888876 ~ 3240545\n";
            if (제작사 == "히트박스")
                res += "1888876 ~ 3240545\n";
            if (감독 == "김휘"
            && 제작사 == "(주)누리픽쳐스")
                res += "1888876 ~ 3240545\n";
            if (감독 == "김동원")
                res += "1108072 ~ 1888876\n";
            if (감독 == "임상윤")
                res += "1108072 ~ 1888876\n";
            if (감독 == "존 추")
                res += "1108072 ~ 1888876\n";
            if (감독 == "J.J. 에이브럼스")
                res += "1108072 ~ 1888876\n";
            if (감독 == "김용균")
                res += "1108072 ~ 1888876\n";
            if (감독 == "전계수")
                res += "1108072 ~ 1888876\n";
            if (감독 == "스티브 마티노")
                res += "1108072 ~ 1888876\n";
            if (감독 == "마이크 트메이어")
                res += "1108072 ~ 1888876\n";
            if (감독 == "김홍선")
                res += "1108072 ~ 1888876\n";
            if (감독 == "김형준")
                res += "1108072 ~ 1888876\n";
            if (감독 == "조동오")
                res += "1108072 ~ 1888876\n";
            if (감독 == "문현성")
                res += "1108072 ~ 1888876\n";
            if (감독 == "에릭 다넬")
                res += "1108072 ~ 1888876\n";
            if (감독 == "톰 맥그라스")
                res += "1108072 ~ 1888876\n";
            if (감독 == "콘래드 베논")
                res += "1108072 ~ 1888876\n";
            if (감독 == "우민호")
                res += "1108072 ~ 1888876\n";
            if (감독 == "존 무어")
                res += "1108072 ~ 1888876\n";
            if (감독 == "올리비에 나카슈")
                res += "1108072 ~ 1888876\n";
            if (감독 == "에릭 톨레다노")
                res += "1108072 ~ 1888876\n";
            if (감독 == "유하")
                res += "1108072 ~ 1888876\n";
            if (감독 == "방은진")
                res += "1108072 ~ 1888876\n";
            if (감독 == "벤 스타센")
                res += "1108072 ~ 1888876\n";
            if (감독 == "신태라")
                res += "1108072 ~ 1888876\n";
            if (감독 == "정지우")
                res += "1108072 ~ 1888876\n";
            if (감독 == "렌 와이즈먼")
                res += "1108072 ~ 1888876\n";
            if (감독 == "임상수")
                res += "1108072 ~ 1888876\n";
            if (감독 == "브레드 페이튼")
                res += "1108072 ~ 1888876\n";
            if (감독 == "조나단 레빈")
                res += "1108072 ~ 1888876\n";
            if (감독 == "노덕")
                res += "1108072 ~ 1888876\n";
            if (감독 == "강우석")
                res += "1108072 ~ 1888876\n";
            if (감독 == "조셉 코신스키")
                res += "1108072 ~ 1888876\n";
            if (감독 == "송해성")
                res += "1108072 ~ 1888876\n";
            if (감독 == "바즈 루어만")
                res += "1108072 ~ 1888876\n";
            if (제작사 == "나의PS파트너 문화산업전문회사")
                res += "1108072 ~ 1888876\n";
            if (감독 == "정기훈")
                res += "1108072 ~ 1888876\n";
            if (감독 == "마크 앤드류스")
                res += "1108072 ~ 1888876\n";
            if (감독 == "브렌다 채프먼")
                res += "1108072 ~ 1888876\n";
            if (감독 == "윤종찬")
                res += "1108072 ~ 1888876\n";
            if (감독 == "저스틴 린")
                res += "1108072 ~ 1888876\n";
            if (감독 == "한상호")
                res += "615783 ~ 1108072\n";
            if (감독 == "피터 램지")
                res += "615783 ~ 1108072\n";
            if (감독 == "권칠인")
                res += "615783 ~ 1108072\n";
            if (감독 == "신정원")
                res += "615783 ~ 1108072\n";
            if (감독 == "오스카 요나손")
                res += "615783 ~ 1108072\n";
            if (감독 == "토비 젠켈")
                res += "615783 ~ 1108072\n";
            if (감독 == "거나 칼슨")
                res += "615783 ~ 1108072\n";
            if (감독 == "임순례")
                res += "615783 ~ 1108072\n";
            if (감독 == "맥지")
                res += "615783 ~ 1108072\n";
            if (감독 == "루퍼트 샌더스")
                res += "615783 ~ 1108072\n";
            if (감독 == "브라이언 싱어")
                res += "615783 ~ 1108072\n";
            if (감독 == "커크 드 미코")
                res += "615783 ~ 1108072\n";
            if (감독 == "크리스 샌더스")
                res += "615783 ~ 1108072\n";
            if (감독 == "토니 길로이")
                res += "615783 ~ 1108072\n";
            if (감독 == "우선호")
                res += "615783 ~ 1108072\n";
            if (감독 == "김용한")
                res += "615783 ~ 1108072\n";
            if (감독 == "리들리 스콧")
                res += "615783 ~ 1108072\n";
            if (감독 == "조나단 리브스만")
                res += "615783 ~ 1108072\n";
            if (감독 == "김태경")
                res += "615783 ~ 1108072\n";
            if (감독 == "앤드류 스탠든")
                res += "615783 ~ 1108072\n";
            if (감독 == "장규성")
                res += "615783 ~ 1108072\n";
            if (감독 == "겐디 타르타코프스키")
                res += "615783 ~ 1108072\n";
            if (감독 == "크리스토퍼 맥쿼리")
                res += "615783 ~ 1108072\n";
            if (감독 == "후안 안토니오 바요나")
                res += "615783 ~ 1108072\n";
            if (감독 == "박영균")
                res += "615783 ~ 1108072\n";
            if (감독 == "이종필")
                res += "615783 ~ 1108072\n";
            if (감독 == "정용기")
                res += "615783 ~ 1108072\n";
            if (감독 == "스콧 스피어")
                res += "615783 ~ 1108072\n";
            if (감독 == "리치 무어")
                res += "615783 ~ 1108072\n";
            if (감독 == "게리 로스")
                res += "339294 ~ 615783\n";
            if (감독 == "김달중")
                res += "339294 ~ 615783\n";
            if (감독 == "폴 W.S. 앤더슨")
                res += "339294 ~ 615783\n";
            if (감독 == "박철관")
                res += "339294 ~ 615783\n";
            if (감독 == "제임스 매더스")
                res += "339294 ~ 615783\n";
            if (감독 == "스테판 S")
                res += "물毒?then 339294 ~ 615783\n";
            if (감독 == "김동빈")
                res += "339294 ~ 615783\n";
            if (감독 == "티무르 베크맘베토브")
                res += "339294 ~ 615783\n";
            if (감독 == "권호영")
                res += "339294 ~ 615783\n";
            if (감독 == "샘 레이미")
                res += "339294 ~ 615783\n";
            if (감독 == "M. 나이트 샤말란")
                res += "339294 ~ 615783\n";
            if (감독 == "애스게르 레스")
                res += "339294 ~ 615783\n";
            if (감독 == "타셈 싱")
                res += "339294 ~ 615783\n";
            if (감독 == "라이언 존슨")
                res += "339294 ~ 615783\n";
            if (감독 == "한지승")
                res += "339294 ~ 615783\n";
            if (감독 == "사이먼 웨스트")
                res += "339294 ~ 615783\n";
            if (감독 == "데이빗 핀처")
                res += "339294 ~ 615783\n";
            if (감독 == "조쉬 트랭크")
                res += "339294 ~ 615783\n";
            if (감독 == "앤디 워쇼스키")
                res += "339294 ~ 615783\n";
            if (감독 == "라나 워쇼스키")
                res += "339294 ~ 615783\n";
            if (감독 == "톰 튀크베어")
                res += "339294 ~ 615783\n";
            if (감독 == "이원석")
                res += "339294 ~ 615783\n";
            if (감독 == "박찬욱")
                res += "339294 ~ 615783\n";
            if (감독 == "롤랜드 에머리히")
                res += "339294 ~ 615783\n";
            if (감독 == "김기덕")
                res += "339294 ~ 615783\n";
            if (감독 == "시즈노 코분")
                res += "339294 ~ 615783\n";
            if (감독 == "정승구")
                res += "339294 ~ 615783\n";
            if (감독 == "우디 알렌"
            && 제작사 == "(주)더블앤조이픽쳐스")
                res += "339294 ~ 615783\n";
            if (감독 == "정범식"
            && 관람등급 == "15세이상관람가")
                res += "339294 ~ 615783\n";
            if (감독 == "팀 버튼"
            && 제작사 == "워너브러더스코리아(주)")
                res += "339294 ~ 615783\n";
            if (감독 == "김성호"
            && 배급사 == "롯데쇼핑㈜롯데엔터테인먼트")
                res += "339294 ~ 615783\n";
            if (감독 == "조성희"
            && 계절 == "겨울")
                res += "339294 ~ 615783\n";
            if (감독 == "야마모토 야스이치로"
            && 제작사 == "씨제이이앤엠 주식회사")
                res += "339294 ~ 615783\n";
            if (감독 == "김휘"
            && 관람등급 == "15세이상관람가")
                res += "339294 ~ 615783\n";
            if (감독 == "민규동"
            && 장르 == "미스터리")
                res += "339294 ~ 615783\n";
            if (감독 == "호소다 마모루")
                res += "188648 ~ 339294\n";
            if (감독 == "만스 말린드")
                res += "188648 ~ 339294\n";
            if (감독 == "비욘 스테인")
                res += "188648 ~ 339294\n";
            if (감독 == "박명랑")
                res += "188648 ~ 339294\n";
            if (감독 == "허진호")
                res += "188648 ~ 339294\n";
            if (감독 == "조 카나한")
                res += "188648 ~ 339294\n";
            if (감독 == "장윤현")
                res += "188648 ~ 339294\n";
            if (감독 == "캐리 주스넌")
                res += "188648 ~ 339294\n";
            if (감독 == "요르겐 레르담")
                res += "188648 ~ 339294\n";
            if (감독 == "토미 위르콜라")
                res += "188648 ~ 339294\n";
            if (감독 == "김진영")
                res += "188648 ~ 339294\n";
            if (감독 == "임대웅")
                res += "188648 ~ 339294\n";
            if (감독 == "김선")
                res += "188648 ~ 339294\n";
            if (감독 == "라인하드 클루스")
                res += "188648 ~ 339294\n";
            if (감독 == "오키우라 히로유키")
                res += "188648 ~ 339294\n";
            if (감독 == "정용주")
                res += "188648 ~ 339294\n";
            if (감독 == "카메론 크로우")
                res += "188648 ~ 339294\n";
            if (감독 == "마스이 소이치")
                res += "188648 ~ 339294\n";
            if (감독 == "세스 맥파라인")
                res += "188648 ~ 339294\n";
            if (감독 == "마이클 수치")
                res += "188648 ~ 339294\n";
            if (감독 == "드류 고다드")
                res += "188648 ~ 339294\n";
            if (감독 == "구자홍")
                res += "188648 ~ 339294\n";
            if (감독 == "이경호")
                res += "188648 ~ 339294\n";
            if (감독 == "닉힐 아드바니")
                res += "188648 ~ 339294\n";
            if (감독 == "성룡")
                res += "188648 ~ 339294\n";
            if (감독 == "쿠엔틴 타란티노")
                res += "188648 ~ 339294\n";
            if (감독 == "폴 앤드류 윌리엄스")
                res += "188648 ~ 339294\n";
            if (감독 == "정익환")
                res += "188648 ~ 339294\n";
            if (제작사 == "㈜씨씨에스미디어")
                res += "188648 ~ 339294\n";
            if (감독 == "유야마 쿠니히코")
                res += "188648 ~ 339294\n";
            if (감독 == "크리스 리노드")
                res += "188648 ~ 339294\n";
            if (감독 == "카일 발다")
                res += "188648 ~ 339294\n";
            if (감독 == "웨인 쏜리")
                res += "188648 ~ 339294\n";
            if (감독 == "육상효")
                res += "188648 ~ 339294\n";
            if (감독 == "배형준")
                res += "188648 ~ 339294\n";
            if (감독 == "엔리케 가토")
                res += "188648 ~ 339294\n";
            if (감독 == "마크 A.Z. 디페")
                res += "188648 ~ 339294\n";
            if (감독 == "리차드 링클레이터")
                res += "188648 ~ 339294\n";
            if (감독 == "정지영"
            && 계절 == "가을")
                res += "188648 ~ 339294\n";
            if (감독 == "홍지영"
            && 배급사 == "롯데쇼핑㈜롯데엔터테인먼트")
                res += "188648 ~ 339294\n";
            if (감독 == "호거 태프"
            && 제작사 == "㈜코리아스크린")
                res += "188648 ~ 339294\n";
            if (감독 == "정범식"
            && 관람등급 == "청소년관람불가")
                res += "188648 ~ 339294\n";
            if (감독 == "민규동"
            && 장르 == "공포(호러)"
            && 관람등급 == "청소년관람불가")
                res += "188648 ~ 339294\n";
            if (감독 == "이근우")
                res += "64195 ~ 188648\n";
            if (감독 == "제임스 왓킨스")
                res += "64195 ~ 188648\n";
            if (제작사 == "(주)부메랑모션픽쳐스")
                res += "64195 ~ 188648\n";
            if (감독 == "스티븐 스필버그")
                res += "64195 ~ 188648\n";
            if (감독 == "김지운")
                res += "64195 ~ 188648\n";
            if (감독 == "리차드 라그라브네스")
                res += "64195 ~ 188648\n";
            if (감독 == "조지 밀러")
                res += "64195 ~ 188648\n";
            if (감독 == "닐 버거")
                res += "64195 ~ 188648\n";
            if (감독 == "미셸 아자나비슈스")
                res += "64195 ~ 188648\n";
            if (감독 == "마크 네브다인")
                res += "64195 ~ 188648\n";
            if (감독 == "브라이언 테일러")
                res += "64195 ~ 188648\n";
            if (감독 == "김익로")
                res += "64195 ~ 188648\n";
            if (감독 == "줄리앙 마그넷")
                res += "64195 ~ 188648\n";
            if (감독 == "존 굴러거")
                res += "64195 ~ 188648\n";
            if (감독 == "데이빗 O. 러셀")
                res += "64195 ~ 188648\n";
            if (감독 == "캐서린 비글로우")
                res += "64195 ~ 188648\n";
            if (감독 == "엔조 달로")
                res += "64195 ~ 188648\n";
            if (감독 == "후안 디에고 솔라나스")
                res += "64195 ~ 188648\n";
            if (감독 == "론 쉐르픽")
                res += "64195 ~ 188648\n";
            if (감독 == "쿠스바 고조")
                res += "64195 ~ 188648\n";
            if (감독 == "다니엘 에스피노사")
                res += "64195 ~ 188648\n";
            if (감독 == "크리스 고락")
                res += "64195 ~ 188648\n";
            if (감독 == "임필성")
                res += "64195 ~ 188648\n";
            if (감독 == "마브룩 엘 메크리")
                res += "64195 ~ 188648\n";
            if (감독 == "아담 쉥크만")
                res += "64195 ~ 188648\n";
            if (감독 == "올 파커")
                res += "64195 ~ 188648\n";
            if (감독 == "사라 폴리")
                res += "64195 ~ 188648\n";
            if (감독 == "앤드레스 무시에티")
                res += "64195 ~ 188648\n";
            if (감독 == "얀 리벡")
                res += "64195 ~ 188648\n";
            if (감독 == "오멸")
                res += "64195 ~ 188648\n";
            if (감독 == "안톤 후쿠아")
                res += "64195 ~ 188648\n";
            if (제작사 == "연분홍 치마")
                res += "64195 ~ 188648\n";
            if (감독 == "제임스 맥티그")
                res += "64195 ~ 188648\n";
            if (감독 == "필리다 로이드")
                res += "64195 ~ 188648\n";
            if (감독 == "벤 애플렉")
                res += "64195 ~ 188648\n";
            if (감독 == "타케모토 노보루")
                res += "64195 ~ 188648\n";
            if (감독 == "윤학렬")
                res += "64195 ~ 188648\n";
            if (감독 == "토마스 알프레드슨")
                res += "64195 ~ 188648\n";
            if (감독 == "순리준")
                res += "64195 ~ 188648\n";
            if (감독 == "더글라스 맥그래스")
                res += "64195 ~ 188648\n";
            if (감독 == "프라파스 콜사라논")
                res += "64195 ~ 188648\n";
            if (감독 == "조 라이트")
                res += "64195 ~ 188648\n";
            if (감독 == "나가미네 타츠야")
                res += "64195 ~ 188648\n";
            if (감독 == "최승호")
                res += "64195 ~ 188648\n";
            if (감독 == "브래드 앤더슨")
                res += "64195 ~ 188648\n";
            if (감독 == "에스벤 토프트 야콥슨")
                res += "64195 ~ 188648\n";
            if (감독 == "김성홍")
                res += "64195 ~ 188648\n";
            if (제작사 == "굿초이스컷픽쳐스(주)")
                res += "64195 ~ 188648\n";
            if (감독 == "야마모토 야스이치로"
            && 제작사 == "얼리버드")
                res += "64195 ~ 188648\n";
            if (감독 == "하나부사 츠토무"
            && 제작사 == "오퍼스픽쳐스(유)")
                res += "64195 ~ 188648\n";
            if (감독 == "미야오 요시카즈"
            && 배급사 == "에이원엔터테인먼트")
                res += "64195 ~ 188648\n";
            if (감독 == "이인항"
            && 배급사 == "KT&G 상상마당 영화사업팀 컴퍼니에스에스(주)")
                res += "64195 ~ 188648\n";
            if (감독 == "조림산"
            && 배급사 == "롯데쇼핑㈜롯데엔터테인먼트")
                res += "64195 ~ 188648\n";
            if (감독 == "우디 알렌"
            && 제작사 == "(주)나이너스엔터테인먼트")
                res += "64195 ~ 188648\n";
            if (제작사 == "(주)에스비에스콘텐츠허브")
                res += "3547 ~ 64195\n";
            if (감독 == "피터 레페니오티스")
                res += "3547 ~ 64195\n";
            if (제작사 == "그린나래미디어(주)")
                res += "3547 ~ 64195\n";
            if (감독 == "데이비드 에이어")
                res += "3547 ~ 64195\n";
            if (감독 == "후지모리 마사야")
                res += "3547 ~ 64195\n";
            if (감독 == "마이클 브랜트")
                res += "3547 ~ 64195\n";
            if (감독 == "아리엘 슐만")
                res += "3547 ~ 64195\n";
            if (감독 == "헨리 유스트")
                res += "3547 ~ 64195\n";
            if (감독 == "김조광수")
                res += "3547 ~ 64195\n";
            if (감독 == "손석")
                res += "3547 ~ 64195\n";
            if (감독 == "홍상수")
                res += "3547 ~ 64195\n";
            if (감독 == "스테판 루조비츠키")
                res += "3547 ~ 64195\n";
            if (감독 == "기욤 이베르넬")
                res += "3547 ~ 64195\n";
            if (감독 == "아르튀르 크왁")
                res += "3547 ~ 64195\n";
            if (감독 == "말콤 벤빌")
                res += "3547 ~ 64195\n";
            if (감독 == "요네타니 요시토모")
                res += "3547 ~ 64195\n";
            if (제작사 == "애니박스 엔터테인먼트")
                res += "3547 ~ 64195\n";
            if (제작사 == "세븐바이투픽쳐스")
                res += "3547 ~ 64195\n";
            if (감독 == "스티븐 소더버그")
                res += "3547 ~ 64195\n";
            if (감독 == "매티스 반 헤이닌겐 주니어")
                res += "3547 ~ 64195\n";
            if (감독 == "제임스 완")
                res += "3547 ~ 64195\n";
            if (감독 == "로저 도날드슨")
                res += "3547 ~ 64195\n";
            if (감독 == "이나 예블라니코바")
                res += "3547 ~ 64195\n";
            if (감독 == "스비야토슬라브 우샤코프")
                res += "3547 ~ 64195\n";
            if (감독 == "아몰 굽트")
                res += "3547 ~ 64195\n";
            if (감독 == "데이빗 크로넨버그")
                res += "3547 ~ 64195\n";
            if (감독 == "제시 페레츠")
                res += "3547 ~ 64195\n";
            if (감독 == "줄리 앤 로빈슨")
                res += "3547 ~ 64195\n";
            if (감독 == "조병옥")
                res += "3547 ~ 64195\n";
            if (감독 == "가렛 에반스")
                res += "3547 ~ 64195\n";
            if (감독 == "라스 폰 트리에")
                res += "3547 ~ 64195\n";
            if (감독 == "사토 히로유키")
                res += "3547 ~ 64195\n";
            if (감독 == "주현량")
                res += "3547 ~ 64195\n";
            if (감독 == "베스 카그맨")
                res += "3547 ~ 64195\n";
            if (감독 == "린 타로")
                res += "3547 ~ 64195\n";
            if (감독 == "파올로 소렌티노")
                res += "3547 ~ 64195\n";
            if (감독 == "안드레이 콘찰로프스키")
                res += "3547 ~ 64195\n";
            if (감독 == "제이크 슈레이어")
                res += "3547 ~ 64195\n";
            if (감독 == "웨스 앤더슨")
                res += "3547 ~ 64195\n";
            if (감독 == "야노 히로유키")
                res += "3547 ~ 64195\n";
            if (감독 == "크리스토프 오노레")
                res += "3547 ~ 64195\n";
            if (감독 == "이기니오 스트라피")
                res += "3547 ~ 64195\n";
            if (감독 == "앤드류 도미닉")
                res += "3547 ~ 64195\n";
            if (감독 == "라스무스 A. 실버르센")
                res += "3547 ~ 64195\n";
            if (감독 == "쿠보오카 토시유키")
                res += "3547 ~ 64195\n";
            if (감독 == "마커스 던스탠")
                res += "3547 ~ 64195\n";
            if (감독 == "우인태")
                res += "3547 ~ 64195\n";
            if (감독 == "강진아")
                res += "3547 ~ 64195\n";
            if (감독 == "샤샤 하트만")
                res += "3547 ~ 64195\n";
            if (감독 == "리처드 링클레이터")
                res += "3547 ~ 64195\n";
            if (제작사 == "CGV 무비꼴라쥬")
                res += "3547 ~ 64195\n";
            if (배급사 == "(주)데이지엔터테인먼트")
                res += "3547 ~ 64195\n";
            if (감독 == "존 힐코트")
                res += "3547 ~ 64195\n";
            if (감독 == "마틴 스콜세지")
                res += "3547 ~ 64195\n";
            if (감독 == "나가이시 다카오")
                res += "3547 ~ 64195\n";
            if (감독 == "스콧 데릭슨")
                res += "3547 ~ 64195\n";
            if (감독 == "존 매든")
                res += "3547 ~ 64195\n";
            if (감독 == "알렉산더 페인")
                res += "3547 ~ 64195\n";
            if (감독 == "발타자르 코루마쿠르")
                res += "3547 ~ 64195\n";
            if (감독 == "켄 콰피스")
                res += "3547 ~ 64195\n";
            if (감독 == "로드리고 코르테스")
                res += "3547 ~ 64195\n";
            if (감독 == "피트 트래비스")
                res += "3547 ~ 64195\n";
            if (감독 == "린 램지")
                res += "3547 ~ 64195\n";
            if (감독 == "파스칼 쇼메유")
                res += "3547 ~ 64195\n";
            if (감독 == "맥스 기와")
                res += "3547 ~ 64195\n";
            if (감독 == "다니아 파스퀴니")
                res += "3547 ~ 64195\n";
            if (감독 == "더 비셔우스 브라더스")
                res += "3547 ~ 64195\n";
            if (감독 == "정재은")
                res += "3547 ~ 64195\n";
            if (감독 == "구파도")
                res += "3547 ~ 64195\n";
            if (감독 == "구혜선")
                res += "3547 ~ 64195\n";
            if (감독 == "마커스 니스펠")
                res += "3547 ~ 64195\n";
            if (감독 == "최진성")
                res += "3547 ~ 64195\n";
            if (감독 == "다비드 포앙키노스")
                res += "3547 ~ 64195\n";
            if (감독 == "스테판 포엔키노스")
                res += "3547 ~ 64195\n";
            if (감독 == "데클란 도넬란")
                res += "3547 ~ 64195\n";
            if (감독 == "닉 오머로드")
                res += "3547 ~ 64195\n";
            if (감독 == "김문흠")
                res += "3547 ~ 64195\n";
            if (감독 == "로만 폴란스키")
                res += "3547 ~ 64195\n";
            if (감독 == "신동엽")
                res += "3547 ~ 64195\n";
            if (감독 == "존 허위츠")
                res += "3547 ~ 64195\n";
            if (감독 == "헤이든 쉬로스버그")
                res += "3547 ~ 64195\n";
            if (감독 == "데렉 시앤프랭스")
                res += "3547 ~ 64195\n";
            if (감독 == "페르난도 트루에바")
                res += "3547 ~ 64195\n";
            if (감독 == "하비에르 마리스칼")
                res += "3547 ~ 64195\n";
            if (감독 == "토노 에란도")
                res += "3547 ~ 64195\n";
            if (감독 == "마크 톤데라이")
                res += "3547 ~ 64195\n";
            if (감독 == "이대희")
                res += "3547 ~ 64195\n";
            if (감독 == "카를로 미라벨라 데이비스")
                res += "3547 ~ 64195\n";
            if (감독 == "크리스 답킨스")
                res += "3547 ~ 64195\n";
            if (감독 == "닉 어거스트 페르나")
                res += "3547 ~ 64195\n";
            if (감독 == "브루스 로빈슨")
                res += "3547 ~ 64195\n";
            if (감독 == "강이관")
                res += "3547 ~ 64195\n";
            if (감독 == "톰 맥카시")
                res += "3547 ~ 64195\n";
            if (감독 == "리처드 J. 루이스")
                res += "3547 ~ 64195\n";
            if (감독 == "오기가미 나오코")
                res += "3547 ~ 64195\n";
            if (감독 == "마미 스나다")
                res += "3547 ~ 64195\n";
            if (감독 == "진재운")
                res += "3547 ~ 64195\n";
            if (감독 == "미타니 코키")
                res += "3547 ~ 64195\n";
            if (감독 == "사부")
                res += "3547 ~ 64195\n";
            if (감독 == "진광교")
                res += "3547 ~ 64195\n";
            if (감독 == "세드릭 칸")
                res += "3547 ~ 64195\n";
            if (감독 == "최종태")
                res += "3547 ~ 64195\n";
            if (감독 == "로코 파팔레오")
                res += "3547 ~ 64195\n";
            if (감독 == "켄 스콧")
                res += "3547 ~ 64195\n";
            if (감독 == "장 피에르 주네")
                res += "3547 ~ 64195\n";
            if (감독 == "조디 포스터")
                res += "3547 ~ 64195\n";
            if (감독 == "야누스 메츠 패더슨")
                res += "3547 ~ 64195\n";
            if (감독 == "임태형")
                res += "3547 ~ 64195\n";
            if (감독 == "파스칼 포자두")
                res += "3547 ~ 64195\n";
            if (감독 == "제롬 데스챔프")
                res += "3547 ~ 64195\n";
            if (감독 == "파스칼 헤롤드")
                res += "3547 ~ 64195\n";
            if (감독 == "마차 마케이에프")
                res += "3547 ~ 64195\n";
            if (감독 == "니콜라이 아르셀")
                res += "3547 ~ 64195\n";
            if (감독 == "장 마크 발레")
                res += "3547 ~ 64195\n";
            if (감독 == "수잔 비에르")
                res += "3547 ~ 64195\n";
            if (감독 == "J.C 챈더")
                res += "3547 ~ 64195\n";
            if (감독 == "토마스 빈터베르그")
                res += "3547 ~ 64195\n";
            if (감독 == "벤 제틀린")
                res += "3547 ~ 64195\n";
            if (감독 == "레미 베잔송")
                res += "3547 ~ 64195\n";
            if (감독 == "로버트 제멕키스")
                res += "3547 ~ 64195\n";
            if (감독 == "이재용")
                res += "3547 ~ 64195\n";
            if (감독 == "롭 코헨")
                res += "3547 ~ 64195\n";
            if (감독 == "장 피에르 아메리스")
                res += "3547 ~ 64195\n";
            if (감독 == "제이슨 무어")
                res += "3547 ~ 64195\n";
            if (감독 == "더스틴 호프만")
                res += "3547 ~ 64195\n";
            if (감독 == "지율")
                res += "3547 ~ 64195\n";
            if (감독 == "루 추안")
                res += "3547 ~ 64195\n";
            if (감독 == "미야지 마사유키")
                res += "3547 ~ 64195\n";
            if (감독 == "데이비드 프랑켈")
                res += "3547 ~ 64195\n";
            if (감독 == "앤드류 니콜")
                res += "3547 ~ 64195\n";
            if (감독 == "알렌 휴즈")
                res += "3547 ~ 64195\n";
            if (감독 == "이지승")
                res += "3547 ~ 64195\n";
            if (감독 == "제프 니콜스")
                res += "3547 ~ 64195\n";
            if (감독 == "안노 히데아키")
                res += "3547 ~ 64195\n";
            if (감독 == "키타가와 에리코")
                res += "3547 ~ 64195\n";
            if (감독 == "마이크 마우루스")
                res += "3547 ~ 64195\n";
            if (감독 == "토마스 보덴스타인")
                res += "3547 ~ 64195\n";
            if (감독 == "파올로 타비아니")
                res += "3547 ~ 64195\n";
            if (감독 == "비토리오 타비아니")
                res += "3547 ~ 64195\n";
            if (감독 == "난니 모레티")
                res += "3547 ~ 64195\n";
            if (감독 == "필리프 팔라도")
                res += "3547 ~ 64195\n";
            if (감독 == "켄 로치")
                res += "3547 ~ 64195\n";
            if (감독 == "레지스 르왕사르")
                res += "3547 ~ 64195\n";
            if (감독 == "남택수")
                res += "3547 ~ 64195\n";
            if (감독 == "댄 마저")
                res += "3547 ~ 64195\n";
            if (감독 == "유지태")
                res += "3547 ~ 64195\n";
            if (감독 == "빌 어거스트")
                res += "3547 ~ 64195\n";
            if (감독 == "권영락")
                res += "3547 ~ 64195\n";
            if (감독 == "오기환")
                res += "3547 ~ 64195\n";
            if (감독 == "저스틴 잭햄")
                res += "3547 ~ 64195\n";
            if (감독 == "에드 게스-도넬리")
                res += "3547 ~ 64195\n";
            if (제작사 == "주식회사 풍경소리")
                res += "3547 ~ 64195\n";
            if (제작사 == "㈜MBC")
                res += "3547 ~ 64195\n";
            if (제작사 == "영화사 랑")
                res += "3547 ~ 64195\n";
            if (제작사 == "크리스리픽쳐스인터내셔널(주)")
                res += "3547 ~ 64195\n";
            if (배급사 == "스튜디오느림보")
                res += "3547 ~ 64195\n";
            if (감독 == "곽경택")
                res += "3547 ~ 64195\n";
            if (감독 == "타케우치 요시오")
                res += "3547 ~ 64195\n";
            if (감독 == "조지 클루니")
                res += "3547 ~ 64195\n";
            if (감독 == "로버트 로렌즈")
                res += "3547 ~ 64195\n";
            if (감독 == "타니구치 고로")
                res += "3547 ~ 64195\n";
            if (감독 == "미카엘 하네케")
                res += "3547 ~ 64195\n";
            if (감독 == "백창주")
                res += "3547 ~ 64195\n";
            if (감독 == "장 피에르 다르덴")
                res += "3547 ~ 64195\n";
            if (감독 == "뤽 다르덴")
                res += "3547 ~ 64195\n";
            if (감독 == "안드리아 아놀드")
                res += "3547 ~ 64195\n";
            if (감독 == "김태균")
                res += "3547 ~ 64195\n";
            if (감독 == "아미르 칸")
                res += "3547 ~ 64195\n";
            if (감독 == "빔 벤더스")
                res += "3547 ~ 64195\n";
            if (감독 == "말릭 벤젠룰")
                res += "3547 ~ 64195\n";
            if (감독 == "마이클 화이트")
                res += "3547 ~ 64195\n";
            if (감독 == "올리버 스톤")
                res += "3547 ~ 64195\n";
            if (감독 == "사이먼 커티스")
                res += "3547 ~ 64195\n";
            if (감독 == "이승준")
                res += "3547 ~ 64195\n";
            if (감독 == "천정훈")
                res += "3547 ~ 64195\n";
            if (감독 == "자비에 보브와")
                res += "3547 ~ 64195\n";
            if (감독 == "민병훈")
                res += "3547 ~ 64195\n";
            if (감독 == "조정래")
                res += "3547 ~ 64195\n";
            if (감독 == "비자이")
                res += "3547 ~ 64195\n";
            if (감독 == "클라우스 해로")
                res += "3547 ~ 64195\n";
            if (감독 == "미시마 유키코")
                res += "3547 ~ 64195\n";
            if (감독 == "스기노 아키오")
                res += "3547 ~ 64195\n";
            if (감독 == "후미히로 요시무라")
                res += "3547 ~ 64195\n";
            if (감독 == "허안화")
                res += "3547 ~ 64195\n";
            if (감독 == "미란다 줄리")
                res += "3547 ~ 64195\n";
            if (감독 == "닉 스트링거")
                res += "3547 ~ 64195\n";
            if (감독 == "패디 콘시딘")
                res += "3547 ~ 64195\n";
            if (감독 == "티모 부오렌솔라")
                res += "3547 ~ 64195\n";
            if (감독 == "매튜 본")
                res += "3547 ~ 64195\n";
            if (감독 == "브렛 설리반")
                res += "3547 ~ 64195\n";
            if (감독 == "사이몬 필립스")
                res += "3547 ~ 64195\n";
            if (감독 == "페오 알라다그")
                res += "3547 ~ 64195\n";
            if (감독 == "사나다 아츠시")
                res += "3547 ~ 64195\n";
            if (감독 == "제이크 스코트")
                res += "3547 ~ 64195\n";
            if (감독 == "사이러스 노라스테")
                res += "3547 ~ 64195\n";
            if (감독 == "크리스티앙 문쥬")
                res += "3547 ~ 64195\n";
            if (감독 == "마우고시카 슈모프스카")
                res += "3547 ~ 64195\n";
            if (감독 == "하라 케이이치")
                res += "3547 ~ 64195\n";
            if (감독 == "로렌스 코너")
                res += "3547 ~ 64195\n";
            if (감독 == "로버트 B. 웨이드")
                res += "3547 ~ 64195\n";
            if (감독 == "태준식")
                res += "3547 ~ 64195\n";
            if (감독 == "알렉산드르 소쿠로브")
                res += "3547 ~ 64195\n";
            if (감독 == "김형렬")
                res += "3547 ~ 64195\n";
            if (감독 == "토니 골드윈")
                res += "3547 ~ 64195\n";
            if (감독 == "다카하타 이사오")
                res += "3547 ~ 64195\n";
            if (감독 == "벤 루윈")
                res += "3547 ~ 64195\n";
            if (감독 == "샘 펠")
                res += "3547 ~ 64195\n";
            if (감독 == "크리스 버틀러")
                res += "3547 ~ 64195\n";
            if (감독 == "양야체")
                res += "3547 ~ 64195\n";
            if (감독 == "장-클리스토페 리에")
                res += "3547 ~ 64195\n";
            if (감독 == "토니 탕")
                res += "3547 ~ 64195\n";
            if (감독 == "양영희")
                res += "3547 ~ 64195\n";
            if (감독 == "장영치")
                res += "3547 ~ 64195\n";
            if (감독 == "알렉산드르 야킴추크")
                res += "3547 ~ 64195\n";
            if (감독 == "엘레나 코발레바")
                res += "3547 ~ 64195\n";
            if (감독 == "신현원")
                res += "3547 ~ 64195\n";
            if (감독 == "올리비에 다한")
                res += "3547 ~ 64195\n";
            if (감독 == "데릭 브룸")
                res += "3547 ~ 64195\n";
            if (감독 == "로저 호킨스")
                res += "3547 ~ 64195\n";
            if (감독 == "레오 까락스")
                res += "3547 ~ 64195\n";
            if (감독 == "릭 로만 워프")
                res += "3547 ~ 64195\n";
            if (감독 == "스티브 맥퀸")
                res += "3547 ~ 64195\n";
            if (감독 == "이창재")
                res += "3547 ~ 64195\n";
            if (감독 == "다니엘 코헨")
                res += "3547 ~ 64195\n";
            if (감독 == "이와사키 토모코")
                res += "3547 ~ 64195\n";
            if (감독 == "마이클 윈터바텀")
                res += "3547 ~ 64195\n";
            if (감독 == "프레드 쉐피시")
                res += "3547 ~ 64195\n";
            if (감독 == "마르잔 사트라피")
                res += "3547 ~ 64195\n";
            if (감독 == "뱅상 파로노")
                res += "3547 ~ 64195\n";
            if (감독 == "랄프 후에트너")
                res += "3547 ~ 64195\n";
            if (제작사 == "(주)머스트 씨 무비")
                res += "3547 ~ 64195\n";
            if (감독 == "조성규"
            && 배급사 == "(주)마인스 엔터테인먼트")
                res += "3547 ~ 64195\n";
            if (감독 == "제임스 마쉬"
            && 제작사 == "판씨네마㈜")
                res += "3547 ~ 64195\n";
            if (감독 == "윌리엄 모나한"
            && 계절 == "가을")
                res += "3547 ~ 64195\n";
            if (감독 == "미야오 요시카즈"
            && 배급사 == "씨제이이앤엠 주식회사")
                res += "3547 ~ 64195\n";
            if (감독 == "서태지"
            && 계절 == "여름")
                res += "3547 ~ 64195\n";
            if (감독 == "이송희일"
            && 제작사 == "(주)시네마달"
            && 배급사 == "(주)시네마달"
            && 계절 == "가을"
            && 장르 == "멜로/로맨스"
            && 관람등급 == "청소년관람불가")
                res += "3547 ~ 64195\n";
            if (감독 == "팀 버튼"
            && 제작사 == "소니픽쳐스릴리징월트디즈니스튜디오스코리아(주)")
                res += "3547 ~ 64195\n";
            if (감독 == "이인항"
            && 배급사 == "(주)팝파트너스")
                res += "3547 ~ 64195\n";
            if (감독 == "겔라 바블루아니"
            && 배급사 == "(주)팝파트너스")
                res += "3547 ~ 64195\n";
            if (감독 == "민규동"
            && 장르 == "드라마")
                res += "3547 ~ 64195\n";
            if (감독 == "뤽 베송"
            && 제작사 == "씨제이이앤엠 주식회사")
                res += "3547 ~ 64195\n";
            if (감독 == "레니 할린"
            && 제작사 == "(주)드림웨스트픽쳐스")
                res += "3547 ~ 64195\n";
            if (감독 == "스기이 기사부로"
            && 장르 == "애니메이션"
            && 제작사 == "(주)미디어캐슬"
            && 배급사 == "(주)나이너스엔터테인먼트"
            && 계절 == "겨울"
            && 관람등급 == "전체관람가")
                res += "3547 ~ 64195\n";
            if (감독 == "마크 포스터"
            && 배급사 == "(주)팝파트너스")
                res += "3547 ~ 64195\n";
            if (감독 == "민규동"
            && 장르 == "멜로/로맨스"
            && 배급사 == "롯데쇼핑㈜롯데엔터테인먼트")
                res += "3547 ~ 64195\n";
            if (장르 == "성인물(에로)")
                res += "0 ~ 3547\n";
            if (배급사 == "(주)케이알씨지")
                res += "0 ~ 3547\n";
            if (배급사 == "(주)조이앤컨텐츠그룹")
                res += "0 ~ 3547\n";
            if (제작사 == "(주)소나무픽쳐스")
                res += "0 ~ 3547\n";
            if (제작사 == "(주)노이에스")
                res += "0 ~ 3547\n";
            if (제작사 == "(주)나우콘텐츠")
                res += "0 ~ 3547\n";
            if (제작사 == "도키엔터테인먼트")
                res += "0 ~ 3547\n";
            if (배급사 == "(주)스넵쏘울")
                res += "0 ~ 3547\n";
            if (배급사 == "㈜코리아스크린")
                res += "0 ~ 3547\n";
            if (배급사 == "(주)수키픽쳐스")
                res += "0 ~ 3547\n";
            if (제작사 == "한국영화아카데미")
                res += "0 ~ 3547\n";
            if (배급사 == "(주)토러스엔터테인먼트")
                res += "0 ~ 3547\n";
            if (배급사 == "(주)케이앤엔터테인먼트")
                res += "0 ~ 3547\n";
            if (배급사 == "(주)루믹스미디어")
                res += "0 ~ 3547\n";
            if (제작사 == "스크린조이")
                res += "0 ~ 3547\n";
            if (배급사 == "(주)마노엔터테인먼트")
                res += "0 ~ 3547\n";
            if (제작사 == "(주)피터팬픽쳐스")
                res += "0 ~ 3547\n";
            if (배급사 == "(주)컴퍼니엘")
                res += "0 ~ 3547\n";
            if (배급사 == "(주)에이브이에이엔터테인먼트")
                res += "0 ~ 3547\n";
            if (감독 == "민두식")
                res += "0 ~ 3547\n";
            if (배급사 == "(주)액티버스엔터테인먼트")
                res += "0 ~ 3547\n";
            if (배급사 == "어뮤즈")
                res += "0 ~ 3547\n";
            if (감독 == "하워드 베이커")
                res += "0 ~ 3547\n";
            if (감독 == "타케키요 히토시")
                res += "0 ~ 3547\n";
            if (감독 == "박철수")
                res += "0 ~ 3547\n";
            if (제작사 == "피디픽쳐스")
                res += "0 ~ 3547\n";
            if (배급사 == "(주)미디어로그")
                res += "0 ~ 3547\n";
            if (감독 == "돈 로이 킹")
                res += "0 ~ 3547\n";
            if (제작사 == "(주)케빈앤컴퍼니")
                res += "0 ~ 3547\n";
            if (감독 == "무라타 카즈야")
                res += "0 ~ 3547\n";
            if (감독 == "요시노 히로시")
                res += "0 ~ 3547\n";
            if (감독 == "오영두")
                res += "0 ~ 3547\n";
            if (감독 == "자비에 장")
                res += "0 ~ 3547\n";
            if (감독 == "박루슬란")
                res += "0 ~ 3547\n";
            if (감독 == "빅터 플레밍")
                res += "0 ~ 3547\n";
            if (감독 == "오토모 가츠히로")
                res += "0 ~ 3547\n";
            if (감독 == "오카무라 텐사이")
                res += "0 ~ 3547\n";
            if (감독 == "모리모토 코지")
                res += "0 ~ 3547\n";
            if (감독 == "어일선")
                res += "0 ~ 3547\n";
            if (감독 == "김건")
                res += "0 ~ 3547\n";
            if (감독 == "카미야마 켄지")
                res += "0 ~ 3547\n";
            if (감독 == "진국부")
                res += "0 ~ 3547\n";
            if (감독 == "고군서")
                res += "0 ~ 3547\n";
            if (감독 == "파트리스 르꽁트")
                res += "0 ~ 3547\n";
            if (제작사 == "포디렉터스")
                res += "0 ~ 3547\n";
            if (제작사 == "서울독립영화제")
                res += "0 ~ 3547\n";
            if (제작사 == "씨네힐")
                res += "0 ~ 3547\n";
            if (배급사 == "미디어소프트")
                res += "0 ~ 3547\n";
            if (배급사 == "브릿지웍스 엔터테인먼트(주)")
                res += "0 ~ 3547\n";
            if (감독 == "S. 샹카르")
                res += "0 ~ 3547\n";
            if (감독 == "박흥식")
                res += "0 ~ 3547\n";
            if (감독 == "잉마르 베리만")
                res += "0 ~ 3547\n";
            if (감독 == "안나 저스티스")
                res += "0 ~ 3547\n";
            if (감독 == "이상우")
                res += "0 ~ 3547\n";
            if (감독 == "다니엘 알프레드슨")
                res += "0 ~ 3547\n";
            if (감독 == "호리키리조노 켄타로")
                res += "0 ~ 3547\n";
            if (감독 == "우다 고노스케")
                res += "0 ~ 3547\n";
            if (감독 == "제임스 보빈")
                res += "0 ~ 3547\n";
            if (감독 == "전수일")
                res += "0 ~ 3547\n";
            if (감독 == "구스타보 헤르난데즈")
                res += "0 ~ 3547\n";
            if (감독 == "헬렌 헌트")
                res += "0 ~ 3547\n";
            if (감독 == "미미 레더")
                res += "0 ~ 3547\n";
            if (감독 == "진목승")
                res += "0 ~ 3547\n";
            if (감독 == "이시바시 요시마사")
                res += "0 ~ 3547\n";
            if (감독 == "시오타니 나오요시")
                res += "0 ~ 3547\n";
            if (감독 == "바틀렛 쉐어")
                res += "0 ~ 3547\n";
            if (감독 == "엘리시아 모신스키")
                res += "0 ~ 3547\n";
            if (감독 == "올리버 파커")
                res += "0 ~ 3547\n";
            if (감독 == "코너 맥퍼슨")
                res += "0 ~ 3547\n";
            if (감독 == "피셔 스티븐스")
                res += "0 ~ 3547\n";
            if (감독 == "정하린")
                res += "0 ~ 3547\n";
            if (감독 == "리 타마호리")
                res += "0 ~ 3547\n";
            if (제작사 == "(주)맑음영화사")
                res += "0 ~ 3547\n";
            if (제작사 == "(주)에이씨피컴퍼니")
                res += "0 ~ 3547\n";
            if (제작사 == "(주)영진크리에이티브")
                res += "0 ~ 3547\n";
            if (제작사 == "마스터 클래스의 산책 제작위원회")
                res += "0 ~ 3547\n";
            if (배급사 == "시네마달")
                res += "0 ~ 3547\n";
            if (배급사 == "㈜크래커픽쳐스")
                res += "0 ~ 3547\n";
            if (감독 == "이광국")
                res += "0 ~ 3547\n";
            if (감독 == "김경묵")
                res += "0 ~ 3547\n";
            if (감독 == "존 건")
                res += "0 ~ 3547\n";
            if (감독 == "백승화")
                res += "0 ~ 3547\n";
            if (감독 == "발레리 게르기예프")
                res += "0 ~ 3547\n";
            if (감독 == "오키타 슈이치")
                res += "0 ~ 3547\n";
            if (감독 == "김희정")
                res += "0 ~ 3547\n";
            if (감독 == "백연아")
                res += "0 ~ 3547\n";
            if (감독 == "임진순")
                res += "0 ~ 3547\n";
            if (감독 == "이수성")
                res += "0 ~ 3547\n";
            if (감독 == "데틀레프 북")
                res += "0 ~ 3547\n";
            if (감독 == "크리스티안 E.크리스티안센")
                res += "0 ~ 3547\n";
            if (감독 == "줄리 베르토첼리")
                res += "0 ~ 3547\n";
            if (감독 == "허철")
                res += "0 ~ 3547\n";
            if (감독 == "공귀현")
                res += "0 ~ 3547\n";
            if (감독 == "이마카케 이사무")
                res += "0 ~ 3547\n";
            if (감독 == "댄 러쉬")
                res += "0 ~ 3547\n";
            if (감독 == "지하진")
                res += "0 ~ 3547\n";
            if (감독 == "도미니크 아벨")
                res += "0 ~ 3547\n";
            if (감독 == "피오나 고든")
                res += "0 ~ 3547\n";
            if (감독 == "브루노 로미")
                res += "0 ~ 3547\n";
            if (감독 == "안토니오 니그렛")
                res += "0 ~ 3547\n";
            if (감독 == "버나드 로즈")
                res += "0 ~ 3547\n";
            if (감독 == "로베르트 르빠쥬")
                res += "0 ~ 3547\n";
            if (감독 == "송예섭")
                res += "0 ~ 3547\n";
            if (감독 == "이네 살림")
                res += "0 ~ 3547\n";
            if (감독 == "박광춘")
                res += "0 ~ 3547\n";
            if (감독 == "이주헌")
                res += "0 ~ 3547\n";
            if (감독 == "김기현")
                res += "0 ~ 3547\n";
            if (감독 == "박성수")
                res += "0 ~ 3547\n";
            if (감독 == "백상열")
                res += "0 ~ 3547\n";
            if (감독 == "크리스 무어")
                res += "0 ~ 3547\n";
            if (감독 == "렌조 마르티넬리")
                res += "0 ~ 3547\n";
            if (감독 == "고락중")
                res += "0 ~ 3547\n";
            if (감독 == "박보상")
                res += "0 ~ 3547\n";
            if (감독 == "제이 챈드라세카")
                res += "0 ~ 3547\n";
            if (감독 == "첸 카이거")
                res += "0 ~ 3547\n";
            if (감독 == "전규환")
                res += "0 ~ 3547\n";
            if (감독 == "파라 칸")
                res += "0 ~ 3547\n";
            if (감독 == "마틴 허버티")
                res += "0 ~ 3547\n";
            if (감독 == "진형태")
                res += "0 ~ 3547\n";
            if (감독 == "임흥순")
                res += "0 ~ 3547\n";
            if (감독 == "표만석")
                res += "0 ~ 3547\n";
            if (감독 == "더글라스 아니오코스키")
                res += "0 ~ 3547\n";
            if (감독 == "엘렌 스미트")
                res += "0 ~ 3547\n";
            if (감독 == "아딧탸 초프라")
                res += "0 ~ 3547\n";
            if (감독 == "니나가와 미카")
                res += "0 ~ 3547\n";
            if (감독 == "사토 케이이치")
                res += "0 ~ 3547\n";
            if (감독 == "데이빗 A. 암스트롱")
                res += "0 ~ 3547\n";
            if (감독 == "크리스토퍼 애슐리")
                res += "0 ~ 3547\n";
            if (감독 == "에히디오 코치미글리오")
                res += "0 ~ 3547\n";
            if (감독 == "올리비에 마르셸")
                res += "0 ~ 3547\n";
            if (감독 == "레이노앗 오얼레만스")
                res += "0 ~ 3547\n";
            if (제작사 == "(주)프리비젼엔터테인먼트")
                res += "0 ~ 3547\n";
            if (제작사 == "씨제이 씨지브이(CJ CGV)(주)")
                res += "0 ~ 3547\n";
            if (제작사 == "(재)전주국제영화제조직위원회")
                res += "0 ~ 3547\n";
            if (제작사 == "애즈필름")
                res += "0 ~ 3547\n";
            if (제작사 == "(주)영화사조아")
                res += "0 ~ 3547\n";
            if (배급사 == "(주)미디어캐슬")
                res += "0 ~ 3547\n";
            if (감독 == "리차드 켈리")
                res += "0 ~ 3547\n";
            if (감독 == "스티븐 실버")
                res += "0 ~ 3547\n";
            if (감독 == "아이라 잭스")
                res += "0 ~ 3547\n";
            if (감독 == "크리스 웨이츠")
                res += "0 ~ 3547\n";
            if (감독 == "닐스 아르덴 오플레브")
                res += "0 ~ 3547\n";
            if (감독 == "알랭 레네")
                res += "0 ~ 3547\n";
            if (감독 == "마르탱 프로보스트")
                res += "0 ~ 3547\n";
            if (감독 == "데이빗 홀랜더")
                res += "0 ~ 3547\n";
            if (감독 == "유형")
                res += "0 ~ 3547\n";
            if (감독 == "다카하시 반메이")
                res += "0 ~ 3547\n";
            if (감독 == "히시다 마사카즈")
                res += "0 ~ 3547\n";
            if (감독 == "사사가와 히로시")
                res += "0 ~ 3547\n";
            if (감독 == "아미르 나데리")
                res += "0 ~ 3547\n";
            if (감독 == "야마시타 노부히로")
                res += "0 ~ 3547\n";
            if (감독 == "루카 미니에로")
                res += "0 ~ 3547\n";
            if (감독 == "게레온 베첼")
                res += "0 ~ 3547\n";
            if (감독 == "신수원")
                res += "0 ~ 3547\n";
            if (감독 == "이수연")
                res += "0 ~ 3547\n";
            if (감독 == "파울 슈마츠니")
                res += "0 ~ 3547\n";
            if (감독 == "리 위")
                res += "0 ~ 3547\n";
            if (감독 == "데이빗 겔브")
                res += "0 ~ 3547\n";
            if (감독 == "서극")
                res += "0 ~ 3547\n";
            if (감독 == "한지원")
                res += "0 ~ 3547\n";
            if (감독 == "정대건")
                res += "0 ~ 3547\n";
            if (감독 == "경순")
                res += "0 ~ 3547\n";
            if (감독 == "시나가와 히로시")
                res += "0 ~ 3547\n";
            if (감독 == "크리스티안 히메네즈")
                res += "0 ~ 3547\n";
            if (감독 == "베네덱 플리고프")
                res += "0 ~ 3547\n";
            if (감독 == "유호진")
                res += "0 ~ 3547\n";
            if (감독 == "베노이트 필립폰")
                res += "0 ~ 3547\n";
            if (감독 == "마티유 아말릭")
                res += "0 ~ 3547\n";
            if (감독 == "송일곤")
                res += "0 ~ 3547\n";
            if (감독 == "마이클 그랑디지")
                res += "0 ~ 3547\n";
            if (감독 == "윌리 데커")
                res += "0 ~ 3547\n";
            if (감독 == "배광수")
                res += "0 ~ 3547\n";
            if (감독 == "플로렝 에밀리오 시리")
                res += "0 ~ 3547\n";
            if (감독 == "데스 맥가너프")
                res += "0 ~ 3547\n";
            if (감독 == "데이빗 맥킨지")
                res += "0 ~ 3547\n";
            if (감독 == "이상빈")
                res += "0 ~ 3547\n";
            if (감독 == "프레데릭 와이즈만")
                res += "0 ~ 3547\n";
            if (감독 == "이정황")
                res += "0 ~ 3547\n";
            if (감독 == "강효진")
                res += "0 ~ 3547\n";
            if (감독 == "저스틴 채드윅")
                res += "0 ~ 3547\n";
            if (감독 == "야니케 시스타드 야콥슨")
                res += "0 ~ 3547\n";
            if (감독 == "린 유시엔")
                res += "0 ~ 3547\n";
            if (감독 == "이수정")
                res += "0 ~ 3547\n";
            if (감독 == "수오 마사유키")
                res += "0 ~ 3547\n";
            if (감독 == "카트린느 브레이야")
                res += "0 ~ 3547\n";
            if (감독 == "로랑 펠리")
                res += "0 ~ 3547\n";
            if (감독 == "데이비드 멕비카")
                res += "0 ~ 3547\n";
            if (감독 == "스티븐 워즈워스")
                res += "0 ~ 3547\n";
            if (감독 == "에릭 바레트")
                res += "0 ~ 3547\n";
            if (감독 == "최용석")
                res += "0 ~ 3547\n";
            if (감독 == "피에그 루이기 사마라타니")
                res += "0 ~ 3547\n";
            if (감독 == "스테판 리보자드")
                res += "0 ~ 3547\n";
            if (감독 == "박영철")
                res += "0 ~ 3547\n";
            if (감독 == "팰림 맥더모트")
                res += "0 ~ 3547\n";
            if (감독 == "호베흐또 가흐제이휴")
                res += "0 ~ 3547\n";
            if (감독 == "전화성")
                res += "0 ~ 3547\n";
            if (감독 == "조성형")
                res += "0 ~ 3547\n";
            if (감독 == "인진미")
                res += "0 ~ 3547\n";
            if (감독 == "카를로스 레이가다스")
                res += "0 ~ 3547\n";
            if (감독 == "월리엄 크리스티")
                res += "0 ~ 3547\n";
            if (감독 == "박준범")
                res += "0 ~ 3547\n";
            if (감독 == "이세야 유스케")
                res += "0 ~ 3547\n";
            if (감독 == "피터 도드")
                res += "0 ~ 3547\n";
            if (감독 == "고명안")
                res += "0 ~ 3547\n";
            if (감독 == "위트 스틸먼")
                res += "0 ~ 3547\n";
            if (감독 == "임초현")
                res += "0 ~ 3547\n";
            if (감독 == "박선욱")
                res += "0 ~ 3547\n";
            if (감독 == "코바야시 츠네오")
                res += "0 ~ 3547\n";
            if (감독 == "타라 퍼니아")
                res += "0 ~ 3547\n";
            if (감독 == "뎁 헤이갠")
                res += "0 ~ 3547\n";
            if (감독 == "앙토니 코르디에")
                res += "0 ~ 3547\n";
            if (감독 == "필국지")
                res += "0 ~ 3547\n";
            if (감독 == "메리 램버트")
                res += "0 ~ 3547\n";
            if (감독 == "예스퍼 묄러")
                res += "0 ~ 3547\n";
            if (감독 == "지넴 사카오글루")
                res += "0 ~ 3547\n";
            if (감독 == "헬머 피셔")
                res += "0 ~ 3547\n";
            if (감독 == "김춘찬")
                res += "0 ~ 3547\n";
            if (감독 == "이시오카 마사토")
                res += "0 ~ 3547\n";
            if (감독 == "리 다니엘스")
                res += "0 ~ 3547\n";
            if (감독 == "데미안 코졸레")
                res += "0 ~ 3547\n";
            if (감독 == "박배일")
                res += "0 ~ 3547\n";
            if (감독 == "다니엘 그로우")
                res += "0 ~ 3547\n";
            if (감독 == "박홍민")
                res += "0 ~ 3547\n";
            if (감독 == "페데리코 모시아")
                res += "0 ~ 3547\n";
            if (감독 == "김태곤")
                res += "0 ~ 3547\n";
            if (감독 == "타나다 유키")
                res += "0 ~ 3547\n";
            if (감독 == "김동호")
                res += "0 ~ 3547\n";
            if (감독 == "조지 토레그로사")
                res += "0 ~ 3547\n";
            if (감독 == "크리스티안 펫졸드")
                res += "0 ~ 3547\n";
            if (감독 == "제이콥 아론 에스테스")
                res += "0 ~ 3547\n";
            if (감독 == "아그네츠카 홀랜드")
                res += "0 ~ 3547\n";
            if (감독 == "김혜정")
                res += "0 ~ 3547\n";
            if (감독 == "메건 그리피스")
                res += "0 ~ 3547\n";
            if (감독 == "시시도 준")
                res += "0 ~ 3547\n";
            if (감독 == "로젤린 보쉬")
                res += "0 ~ 3547\n";
            if (감독 == "진승현")
                res += "0 ~ 3547\n";
            if (감독 == "모리시타 코조")
                res += "0 ~ 3547\n";
            if (감독 == "로베르 르빠쥬")
                res += "0 ~ 3547\n";
            if (감독 == "장건재")
                res += "0 ~ 3547\n";
            if (감독 == "크리스 크라우스")
                res += "0 ~ 3547\n";
            if (감독 == "카스퍼 바포드")
                res += "0 ~ 3547\n";
            if (감독 == "버나비 사우스콤")
                res += "0 ~ 3547\n";
            if (감독 == "레이몽 드파르동")
                res += "0 ~ 3547\n";
            if (감독 == "클로딘 누가레")
                res += "0 ~ 3547\n";
            if (감독 == "장 피에로 포넬")
                res += "0 ~ 3547\n";
            if (감독 == "야마다 나오코")
                res += "0 ~ 3547\n";
            if (감독 == "리자 랑세트")
                res += "0 ~ 3547\n";
            if (감독 == "신조 타케히코")
                res += "0 ~ 3547\n";
            if (감독 == "마리아 린드버그")
                res += "0 ~ 3547\n";
            if (감독 == "히암 압바스")
                res += "0 ~ 3547\n";
            if (감독 == "사토 유조")
                res += "0 ~ 3547\n";
            if (제작사 == "(주)에이브이에이엔터테인먼트")
                res += "0 ~ 3547\n";
            if (감독 == "스기이 기사부로"
            && 장르 == "드라마")
                res += "0 ~ 3547\n";
            if (감독 == "스기이 기사부로"
            && 장르 == "판타지")
                res += "0 ~ 3547\n";
            if (제작사 == "(주)스폰지이엔티"
            && 배급사 == "(주)영화사 조제")
                res += "0 ~ 3547\n";
            if (감독 == "변성현"
            && 제작사 == "(주)다세포클럽")
                res += "0 ~ 3547\n";
            if (감독 == "윌리엄 모나한"
            && 계절 == "겨울")
                res += "0 ~ 3547\n";
            if (감독 == "서태지"
            && 계절 == "봄")
                res += "0 ~ 3547\n";
            if (감독 == "이송희일"
            && 제작사 == "(주)시네마달"
            && 배급사 == "(주)시네마달"
            && 계절 == "가을"
            && 장르 == "멜로/로맨스"
            && 관람등급 == "청소년관람불가")
                res += "0 ~ 3547\n";
            if (감독 == "스기이 기사부로"
            && 제작사 == "(주)미디어캐슬"
            && 배급사 == "(주)나이너스엔터테인먼트"
            && 계절 == "겨울"
            && 장르 == "애니메이션"
            && 관람등급 == "전체관람가")
                res += "0 ~ 3547\n";
            if (감독 == "홍지영"
            && 배급사 == "골든타이드픽처스(주)")
                res += "0 ~ 3547\n";
            if (감독 == "김성호"
            && 배급사 == "골든타이드픽처스(주)")
                res += "0 ~ 3547\n";

            return res;
        }
    }
}
