using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace MoveMove.Rules
{
    class DecistionTree
    {
        public static string rule;
        static public string get(string 감독, string 계절, string 제작사, string 장르, string 관람등급, string 배급사)
        {
            string res = "";
            rule = "";
            if (감독 == "멜라니 로랑")
            {
                rule += "If 감독 is 멜라니 로랑 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "S. 샹카르")
            {
                rule += "If 감독 is S. 샹카르 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "무라타 카즈야")
            {
                rule += "If 감독 is 무라타 카즈야 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "박흥식")
            {
                rule += "If 감독 is 박흥식 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "이광국")
            {
                rule += "If 감독 is 이광국 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "수유 린")
            {
                rule += "If 감독 is 수유 린 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "리차드 켈리")
            {
                rule += "If 감독 is 리차드 켈리 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "스티븐 실버")
            {
                rule += "If 감독 is 스티븐 실버 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "아이라 잭스")
            {
                rule += "If 감독 is 아이라 잭스 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "루나 루나슨")
            {
                rule += "If 감독 is 루나 루나슨 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "크리스 웨이츠")
            {
                rule += "If 감독 is 크리스 웨이츠 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "닐스 아르덴 오플레브")
            {
                rule += "If 감독 is 닐스 아르덴 오플레브 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "알랭 레네")
            {
                rule += "If 감독 is 알랭 레네 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "요시노 히로시")
            {
                rule += "If 감독 is 요시노 히로시 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "마르탱 프로보스트")
            {
                rule += "If 감독 is 마르탱 프로보스트 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "데이빗 홀랜더")
            {
                rule += "If 감독 is 데이빗 홀랜더 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "잉마르 베리만")
            {
                rule += "If 감독 is 잉마르 베리만 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "벨라 타르")
            {
                rule += "If 감독 is 벨라 타르 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "신아가")
            {
                rule += "If 감독 is 신아가 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "이상철")
            {
                rule += "If 감독 is 이상철 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "김경묵")
            {
                rule += "If 감독 is 김경묵 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "안나 저스티스")
            {
                rule += "If 감독 is 안나 저스티스 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "유형")
            {
                rule += "If 감독 is 유형 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "존 건")
            {
                rule += "If 감독 is 존 건 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "다카하시 반메이")
            {
                rule += "If 감독 is 다카하시 반메이 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "히시다 마사카즈")
            {
                rule += "If 감독 is 히시다 마사카즈 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "사사가와 히로시")
            {
                rule += "If 감독 is 사사가와 히로시 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "이상우")
            {
                rule += "If 감독 is 이상우 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "지민")
            {
                rule += "If 감독 is 지민 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "이송희일")
            {
                rule += "If 감독 is 이송희일 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "아미르 나데리")
            {
                rule += "If 감독 is 아미르 나데리 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "야마시타 노부히로")
            {
                rule += "If 감독 is 야마시타 노부히로 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "루카 미니에로")
            {
                rule += "If 감독 is 루카 미니에로 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "게레온 베첼")
            {
                rule += "If 감독 is 게레온 베첼 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "다니엘 알프레드슨")
            {
                rule += "If 감독 is 다니엘 알프레드슨 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "신수원")
            {
                rule += "If 감독 is 신수원 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "홍지영")
            {
                rule += "If 감독 is 홍지영 -> "; if (배급사 == "(주)프리비젼엔터테인먼트")
                {
                    rule += "If 배급사 is (주)프리비젼엔터테인먼트 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "예지림엔터테인먼트")
                {
                    rule += "If 배급사 is 예지림엔터테인먼트 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "㈜미로비젼")
                {
                    rule += "If 배급사 is ㈜미로비젼 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "씨네21아이(주)")
                {
                    rule += "If 배급사 is 씨네21아이(주) -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "씨제이 씨지브이(CJ CGV)(주)")
                {
                    rule += "If 배급사 is 씨제이 씨지브이(CJ CGV)(주) -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)시너지하우스 (시너지)")
                {
                    rule += "If 배급사 is (주)시너지하우스 (시너지) -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)에스와이코마드")
                {
                    rule += "If 배급사 is (주)에스와이코마드 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)영화사 진진")
                {
                    rule += "If 배급사 is (주)영화사 진진 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "판씨네마㈜")
                {
                    rule += "If 배급사 is 판씨네마㈜ -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "팝엔터테인먼트")
                {
                    rule += "If 배급사 is 팝엔터테인먼트 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)영화사 조제")
                {
                    rule += "If 배급사 is (주)영화사 조제 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "골든타이드픽처스(주)")
                {
                    rule += "If 배급사 is 골든타이드픽처스(주) -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)스크린와이즈")
                {
                    rule += "If 배급사 is (주)스크린와이즈 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "㈜영화사 백두대간")
                {
                    rule += "If 배급사 is ㈜영화사 백두대간 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(재)전주국제영화제조직위원회")
                {
                    rule += "If 배급사 is (재)전주국제영화제조직위원회 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "㈜인디스토리")
                {
                    rule += "If 배급사 is ㈜인디스토리 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)마운틴픽쳐스")
                {
                    rule += "If 배급사 is (주)마운틴픽쳐스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "데이브인터랙티브")
                {
                    rule += "If 배급사 is 데이브인터랙티브 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "시네마달")
                {
                    rule += "If 배급사 is 시네마달 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)시네마달")
                {
                    rule += "If 배급사 is (주)시네마달 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)나이너스엔터테인먼트")
                {
                    rule += "If 배급사 is (주)나이너스엔터테인먼트 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "찬란")
                {
                    rule += "If 배급사 is 찬란 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)마인스 엔터테인먼트")
                {
                    rule += "If 배급사 is (주)마인스 엔터테인먼트 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)누리픽쳐스")
                {
                    rule += "If 배급사 is (주)누리픽쳐스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "롤러코스터")
                {
                    rule += "If 배급사 is 롤러코스터 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "어뮤즈")
                {
                    rule += "If 배급사 is 어뮤즈 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)인스터피씨엠")
                {
                    rule += "If 배급사 is (주)인스터피씨엠 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)액티버스엔터테인먼트")
                {
                    rule += "If 배급사 is (주)액티버스엔터테인먼트 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)키노아이디엠씨")
                {
                    rule += "If 배급사 is (주)키노아이디엠씨 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "오드")
                {
                    rule += "If 배급사 is 오드 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)에스비에스콘텐츠허브")
                {
                    rule += "If 배급사 is (주)에스비에스콘텐츠허브 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)소나무픽쳐스")
                {
                    rule += "If 배급사 is (주)소나무픽쳐스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)싸이더스에프앤에이치")
                {
                    rule += "If 배급사 is (주)싸이더스에프앤에이치 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "씨제이이앤엠 주식회사")
                {
                    rule += "If 배급사 is 씨제이이앤엠 주식회사 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)영화사폴")
                {
                    rule += "If 배급사 is (주)영화사폴 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)케빈앤컴퍼니")
                {
                    rule += "If 배급사 is (주)케빈앤컴퍼니 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "한국소니픽쳐스릴리징브에나비스타영화㈜")
                {
                    rule += "If 배급사 is 한국소니픽쳐스릴리징브에나비스타영화㈜ -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)엠레콘")
                {
                    rule += "If 배급사 is (주)엠레콘 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)토러스엔터테인먼트")
                {
                    rule += "If 배급사 is (주)토러스엔터테인먼트 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)엣나인필름")
                {
                    rule += "If 배급사 is (주)엣나인필름 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)영화사조아")
                {
                    rule += "If 배급사 is (주)영화사조아 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)미디어로그")
                {
                    rule += "If 배급사 is (주)미디어로그 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "라인트리엔터테인먼트")
                {
                    rule += "If 배급사 is 라인트리엔터테인먼트 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "엠투")
                {
                    rule += "If 배급사 is 엠투 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)팝엔터테인먼트")
                {
                    rule += "If 배급사 is (주)팝엔터테인먼트 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)스넵쏘울")
                {
                    rule += "If 배급사 is (주)스넵쏘울 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)컴퍼니엘")
                {
                    rule += "If 배급사 is (주)컴퍼니엘 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "페퍼민트픽쳐스")
                {
                    rule += "If 배급사 is 페퍼민트픽쳐스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)두타연")
                {
                    rule += "If 배급사 is (주)두타연 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)미디어데이")
                {
                    rule += "If 배급사 is (주)미디어데이 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "씨너스엔터테인먼트(주)")
                {
                    rule += "If 배급사 is 씨너스엔터테인먼트(주) -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "롯데쇼핑㈜롯데엔터테인먼트")
                {
                    rule += "If 배급사 is 롯데쇼핑㈜롯데엔터테인먼트 -> "; res += "188648 ~ 339294\n";
                    rule += "188648 ~ 339294\n";
                }
                else if (배급사 == "이십세기폭스코리아(주)")
                {
                    rule += "If 배급사 is 이십세기폭스코리아(주) -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "유니버설픽쳐스인터내셔널 코리아(유)")
                {
                    rule += "If 배급사 is 유니버설픽쳐스인터내셔널 코리아(유) -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "쇼박스㈜미디어플렉스")
                {
                    rule += "If 배급사 is 쇼박스㈜미디어플렉스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "에이원엔터테인먼트")
                {
                    rule += "If 배급사 is 에이원엔터테인먼트 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)티캐스트")
                {
                    rule += "If 배급사 is (주)티캐스트 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "소니픽쳐스릴리징월트디즈니스튜디오스코리아(주)")
                {
                    rule += "If 배급사 is 소니픽쳐스릴리징월트디즈니스튜디오스코리아(주) -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "타임스토리그룹(주)")
                {
                    rule += "If 배급사 is 타임스토리그룹(주) -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)넥스트엔터테인먼트월드(NEW)")
                {
                    rule += "If 배급사 is (주)넥스트엔터테인먼트월드(NEW) -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)영화제작전원사")
                {
                    rule += "If 배급사 is (주)영화제작전원사 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "워너브러더스코리아(주)")
                {
                    rule += "If 배급사 is 워너브러더스코리아(주) -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "KT&G 상상마당 영화사업팀 컴퍼니에스에스(주)")
                {
                    rule += "If 배급사 is KT&G 상상마당 영화사업팀 컴퍼니에스에스(주) -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)팝파트너스")
                {
                    rule += "If 배급사 is (주)팝파트너스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "필라멘트픽쳐스")
                {
                    rule += "If 배급사 is 필라멘트픽쳐스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "(주)인벤트스톤")
                {
                    rule += "If 배급사 is (주)인벤트스톤 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (배급사 == "영화사청어람(주)")
                {
                    rule += "If 배급사 is 영화사청어람(주) -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
            }
            else if (감독 == "이수연")
            {
                rule += "If 감독 is 이수연 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "김성호")
            {
                rule += "If 감독 is 김성호 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "호리키리조노 켄타로")
            {
                rule += "If 감독 is 호리키리조노 켄타로 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "파울 슈마츠니")
            {
                rule += "If 감독 is 파울 슈마츠니 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "리 위")
            {
                rule += "If 감독 is 리 위 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "데이빗 겔브")
            {
                rule += "If 감독 is 데이빗 겔브 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "백승화")
            {
                rule += "If 감독 is 백승화 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "서극")
            {
                rule += "If 감독 is 서극 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "한지원")
            {
                rule += "If 감독 is 한지원 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "찰리 프리드릭스")
            {
                rule += "If 감독 is 찰리 프리드릭스 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "발레리 게르기예프")
            {
                rule += "If 감독 is 발레리 게르기예프 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "베르트랑 보넬로")
            {
                rule += "If 감독 is 베르트랑 보넬로 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "정대건")
            {
                rule += "If 감독 is 정대건 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "경순")
            {
                rule += "If 감독 is 경순 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "시나가와 히로시")
            {
                rule += "If 감독 is 시나가와 히로시 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "크리스티안 히메네즈")
            {
                rule += "If 감독 is 크리스티안 히메네즈 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "오키타 슈이치")
            {
                rule += "If 감독 is 오키타 슈이치 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "베네덱 플리고프")
            {
                rule += "If 감독 is 베네덱 플리고프 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "조성규")
            {
                rule += "If 감독 is 조성규 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "알렉스 드 라 이글레시아")
            {
                rule += "If 감독 is 알렉스 드 라 이글레시아 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "유호진")
            {
                rule += "If 감독 is 유호진 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "존 하이암즈")
            {
                rule += "If 감독 is 존 하이암즈 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "베노이트 필립폰")
            {
                rule += "If 감독 is 베노이트 필립폰 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "마티유 아말릭")
            {
                rule += "If 감독 is 마티유 아말릭 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "김희정")
            {
                rule += "If 감독 is 김희정 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "송일곤")
            {
                rule += "If 감독 is 송일곤 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "우다 고노스케")
            {
                rule += "If 감독 is 우다 고노스케 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "호요휘")
            {
                rule += "If 감독 is 호요휘 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "다니엘 아르비드")
            {
                rule += "If 감독 is 다니엘 아르비드 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "안드리스 넬슨스")
            {
                rule += "If 감독 is 안드리스 넬슨스 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "백연아")
            {
                rule += "If 감독 is 백연아 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "제임스 보빈")
            {
                rule += "If 감독 is 제임스 보빈 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "마이클 그랑디지")
            {
                rule += "If 감독 is 마이클 그랑디지 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "임진순")
            {
                rule += "If 감독 is 임진순 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "이수성")
            {
                rule += "If 감독 is 이수성 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "강문")
            {
                rule += "If 감독 is 강문 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "릭 비버")
            {
                rule += "If 감독 is 릭 비버 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "데틀레프 북")
            {
                rule += "If 감독 is 데틀레프 북 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "양정호")
            {
                rule += "If 감독 is 양정호 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "히가시 요이치")
            {
                rule += "If 감독 is 히가시 요이치 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "윌리 데커")
            {
                rule += "If 감독 is 윌리 데커 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "크리스티안 E.크리스티안센")
            {
                rule += "If 감독 is 크리스티안 E.크리스티안센 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "줄리 베르토첼리")
            {
                rule += "If 감독 is 줄리 베르토첼리 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "배광수")
            {
                rule += "If 감독 is 배광수 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "정보서")
            {
                rule += "If 감독 is 정보서 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "플로렝 에밀리오 시리")
            {
                rule += "If 감독 is 플로렝 에밀리오 시리 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "구상범")
            {
                rule += "If 감독 is 구상범 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "데스 맥가너프")
            {
                rule += "If 감독 is 데스 맥가너프 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "데이빗 맥킨지")
            {
                rule += "If 감독 is 데이빗 맥킨지 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "치로 카펠라리")
            {
                rule += "If 감독 is 치로 카펠라리 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "이상빈")
            {
                rule += "If 감독 is 이상빈 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "프레데릭 와이즈만")
            {
                rule += "If 감독 is 프레데릭 와이즈만 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "장-루프 펠리시올리")
            {
                rule += "If 감독 is 장-루프 펠리시올리 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "알랭 가뇰")
            {
                rule += "If 감독 is 알랭 가뇰 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "이정황")
            {
                rule += "If 감독 is 이정황 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "허철")
            {
                rule += "If 감독 is 허철 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "강효진")
            {
                rule += "If 감독 is 강효진 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "봉만대")
            {
                rule += "If 감독 is 봉만대 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "오영두")
            {
                rule += "If 감독 is 오영두 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "자비에 장")
            {
                rule += "If 감독 is 자비에 장 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "공귀현")
            {
                rule += "If 감독 is 공귀현 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "조르고스 란시모스")
            {
                rule += "If 감독 is 조르고스 란시모스 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "박루슬란")
            {
                rule += "If 감독 is 박루슬란 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "이마카케 이사무")
            {
                rule += "If 감독 is 이마카케 이사무 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "댄 러쉬")
            {
                rule += "If 감독 is 댄 러쉬 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "저스틴 채드윅")
            {
                rule += "If 감독 is 저스틴 채드윅 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "지하진")
            {
                rule += "If 감독 is 지하진 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "변성현")
            {
                rule += "If 감독 is 변성현 -> "; if (제작사 == "(주)프리비젼엔터테인먼트")
                {
                    rule += "If 제작사/수입사 is (주)프리비젼엔터테인먼트 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)인영트레이딩")
                {
                    rule += "If 제작사/수입사 is (주)인영트레이딩 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)디엔티미디어")
                {
                    rule += "If 제작사/수입사 is (주)디엔티미디어 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "서울시 교육청")
                {
                    rule += "If 제작사/수입사 is 서울시 교육청 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)인벤트스톤")
                {
                    rule += "If 제작사/수입사 is (주)인벤트스톤 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)노마드필름")
                {
                    rule += "If 제작사/수입사 is (주)노마드필름 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)보리픽쳐스")
                {
                    rule += "If 제작사/수입사 is (주)보리픽쳐스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "씨제이 씨지브이(CJ CGV)(주)")
                {
                    rule += "If 제작사/수입사 is 씨제이 씨지브이(CJ CGV)(주) -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)데이지엔터테인먼트")
                {
                    rule += "If 제작사/수입사 is (주)데이지엔터테인먼트 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)에스와이코마드")
                {
                    rule += "If 제작사/수입사 is (주)에스와이코마드 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)레인보우팩토리")
                {
                    rule += "If 제작사/수입사 is (주)레인보우팩토리 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "판씨네마㈜")
                {
                    rule += "If 제작사/수입사 is 판씨네마㈜ -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)루믹스미디어")
                {
                    rule += "If 제작사/수입사 is (주)루믹스미디어 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)영화사 조제")
                {
                    rule += "If 제작사/수입사 is (주)영화사 조제 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)컴퍼니엘")
                {
                    rule += "If 제작사/수입사 is (주)컴퍼니엘 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)조이앤컨텐츠그룹")
                {
                    rule += "If 제작사/수입사 is (주)조이앤컨텐츠그룹 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "㈜영화사 백두대간")
                {
                    rule += "If 제작사/수입사 is ㈜영화사 백두대간 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(재)전주국제영화제조직위원회")
                {
                    rule += "If 제작사/수입사 is (재)전주국제영화제조직위원회 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "애즈필름")
                {
                    rule += "If 제작사/수입사 is 애즈필름 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "얼라이브픽쳐스")
                {
                    rule += "If 제작사/수입사 is 얼라이브픽쳐스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "경픽쳐스")
                {
                    rule += "If 제작사/수입사 is 경픽쳐스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "미디어소프트")
                {
                    rule += "If 제작사/수입사 is 미디어소프트 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "데이브인터랙티브")
                {
                    rule += "If 제작사/수입사 is 데이브인터랙티브 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "가나미디어")
                {
                    rule += "If 제작사/수입사 is 가나미디어 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "㈜미로비젼")
                {
                    rule += "If 제작사/수입사 is ㈜미로비젼 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)인디컴미디어")
                {
                    rule += "If 제작사/수입사 is (주)인디컴미디어 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "반이다")
                {
                    rule += "If 제작사/수입사 is 반이다 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "스튜디오 오후출근")
                {
                    rule += "If 제작사/수입사 is 스튜디오 오후출근 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)시네마달")
                {
                    rule += "If 제작사/수입사 is (주)시네마달 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)스폰지이엔티")
                {
                    rule += "If 제작사/수입사 is (주)스폰지이엔티 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)영화사 자미")
                {
                    rule += "If 제작사/수입사 is (주)영화사 자미 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)나이너스엔터테인먼트")
                {
                    rule += "If 제작사/수입사 is (주)나이너스엔터테인먼트 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "찬란")
                {
                    rule += "If 제작사/수입사 is 찬란 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)수필름")
                {
                    rule += "If 제작사/수입사 is (주)수필름 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "포디렉터스")
                {
                    rule += "If 제작사/수입사 is 포디렉터스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "씨네21아이(주)")
                {
                    rule += "If 제작사/수입사 is 씨네21아이(주) -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)영화사 진진")
                {
                    rule += "If 제작사/수입사 is (주)영화사 진진 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "㈜인디스토리")
                {
                    rule += "If 제작사/수입사 is ㈜인디스토리 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "러브락컴퍼니")
                {
                    rule += "If 제작사/수입사 is 러브락컴퍼니 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)누리픽쳐스")
                {
                    rule += "If 제작사/수입사 is (주)누리픽쳐스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "롤러코스터")
                {
                    rule += "If 제작사/수입사 is 롤러코스터 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "피엠피앤컴퍼니")
                {
                    rule += "If 제작사/수입사 is 피엠피앤컴퍼니 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)인스터피씨엠")
                {
                    rule += "If 제작사/수입사 is (주)인스터피씨엠 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "라인트리엔터테인먼트")
                {
                    rule += "If 제작사/수입사 is 라인트리엔터테인먼트 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "다카포필름")
                {
                    rule += "If 제작사/수입사 is 다카포필름 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "독립프로덕션빨간눈사람")
                {
                    rule += "If 제작사/수입사 is 독립프로덕션빨간눈사람 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)키노아이디엠씨")
                {
                    rule += "If 제작사/수입사 is (주)키노아이디엠씨 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "㈜코리아스크린")
                {
                    rule += "If 제작사/수입사 is ㈜코리아스크린 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)피터팬픽쳐스")
                {
                    rule += "If 제작사/수입사 is (주)피터팬픽쳐스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "에스비에스 바이아컴 유한회사")
                {
                    rule += "If 제작사/수입사 is 에스비에스 바이아컴 유한회사 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)소나무픽쳐스")
                {
                    rule += "If 제작사/수입사 is (주)소나무픽쳐스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)영화사폴")
                {
                    rule += "If 제작사/수입사 is (주)영화사폴 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)마운틴픽쳐스")
                {
                    rule += "If 제작사/수입사 is (주)마운틴픽쳐스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "씨제이이앤엠 주식회사")
                {
                    rule += "If 제작사/수입사 is 씨제이이앤엠 주식회사 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "얼리버드")
                {
                    rule += "If 제작사/수입사 is 얼리버드 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)케빈앤컴퍼니")
                {
                    rule += "If 제작사/수입사 is (주)케빈앤컴퍼니 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "프로덕션공방")
                {
                    rule += "If 제작사/수입사 is 프로덕션공방 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)이든픽쳐스")
                {
                    rule += "If 제작사/수입사 is (주)이든픽쳐스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "한국소니픽쳐스릴리징브에나비스타영화㈜")
                {
                    rule += "If 제작사/수입사 is 한국소니픽쳐스릴리징브에나비스타영화㈜ -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "스토리룸")
                {
                    rule += "If 제작사/수입사 is 스토리룸 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "LEE FILM")
                {
                    rule += "If 제작사/수입사 is LEE FILM -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)나우콘텐츠")
                {
                    rule += "If 제작사/수입사 is (주)나우콘텐츠 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)트리니티네트워크")
                {
                    rule += "If 제작사/수입사 is (주)트리니티네트워크 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)엣나인필름")
                {
                    rule += "If 제작사/수입사 is (주)엣나인필름 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "한국영화아카데미")
                {
                    rule += "If 제작사/수입사 is 한국영화아카데미 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)영화사조아")
                {
                    rule += "If 제작사/수입사 is (주)영화사조아 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "영화사 도로시(주)")
                {
                    rule += "If 제작사/수입사 is 영화사 도로시(주) -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)미디어로그")
                {
                    rule += "If 제작사/수입사 is (주)미디어로그 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "피디픽쳐스")
                {
                    rule += "If 제작사/수입사 is 피디픽쳐스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)스테이지팩토리")
                {
                    rule += "If 제작사/수입사 is (주)스테이지팩토리 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "알토미디어(주)")
                {
                    rule += "If 제작사/수입사 is 알토미디어(주) -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "엠투")
                {
                    rule += "If 제작사/수입사 is 엠투 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)아우라픽처스")
                {
                    rule += "If 제작사/수입사 is (주)아우라픽처스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "엔터시네마")
                {
                    rule += "If 제작사/수입사 is 엔터시네마 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)키노크러시")
                {
                    rule += "If 제작사/수입사 is (주)키노크러시 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)스넵쏘울")
                {
                    rule += "If 제작사/수입사 is (주)스넵쏘울 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "영화사뜰(주)")
                {
                    rule += "If 제작사/수입사 is 영화사뜰(주) -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "키노망고스틴")
                {
                    rule += "If 제작사/수입사 is 키노망고스틴 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "킹레코드")
                {
                    rule += "If 제작사/수입사 is 킹레코드 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "잉스팅크티브 필름")
                {
                    rule += "If 제작사/수입사 is 잉스팅크티브 필름 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "스파이럴 프로젝트")
                {
                    rule += "If 제작사/수입사 is 스파이럴 프로젝트 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "플라잉타이거픽처스")
                {
                    rule += "If 제작사/수입사 is 플라잉타이거픽처스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "페퍼민트픽쳐스")
                {
                    rule += "If 제작사/수입사 is 페퍼민트픽쳐스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "스피나치앤빈")
                {
                    rule += "If 제작사/수입사 is 스피나치앤빈 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)다세포클럽")
                {
                    rule += "If 제작사/수입사 is (주)다세포클럽 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)동녘필름")
                {
                    rule += "If 제작사/수입사 is (주)동녘필름 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "영화제작소 다")
                {
                    rule += "If 제작사/수입사 is 영화제작소 다 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)부메랑모션픽쳐스|(주)드림웨스트픽쳐스")
                {
                    rule += "If 제작사/수입사 is (주)부메랑모션픽쳐스|(주)드림웨스트픽쳐스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "대원미디어㈜")
                {
                    rule += "If 제작사/수입사 is 대원미디어㈜ -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "파라마운트")
                {
                    rule += "If 제작사/수입사 is 파라마운트 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "이십세기폭스코리아(주)")
                {
                    rule += "If 제작사/수입사 is 이십세기폭스코리아(주) -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "유니버설픽쳐스인터내셔널 코리아(유)")
                {
                    rule += "If 제작사/수입사 is 유니버설픽쳐스인터내셔널 코리아(유) -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "청년필름(주)")
                {
                    rule += "If 제작사/수입사 is 청년필름(주) -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "한국게이인권운동단체 친구사이")
                {
                    rule += "If 제작사/수입사 is 한국게이인권운동단체 친구사이 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)포커스앤컴퍼니")
                {
                    rule += "If 제작사/수입사 is (주)포커스앤컴퍼니 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)트리니티엔터테인먼트")
                {
                    rule += "If 제작사/수입사 is (주)트리니티엔터테인먼트 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "에이원엔터테인먼트")
                {
                    rule += "If 제작사/수입사 is 에이원엔터테인먼트 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)티캐스트")
                {
                    rule += "If 제작사/수입사 is (주)티캐스트 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "쇼박스㈜미디어플렉스")
                {
                    rule += "If 제작사/수입사 is 쇼박스㈜미디어플렉스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "소니픽쳐스릴리징월트디즈니스튜디오스코리아(주)")
                {
                    rule += "If 제작사/수입사 is 소니픽쳐스릴리징월트디즈니스튜디오스코리아(주) -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)메인타이틀픽쳐스")
                {
                    rule += "If 제작사/수입사 is (주)메인타이틀픽쳐스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)드림웨스트픽쳐스")
                {
                    rule += "If 제작사/수입사 is (주)드림웨스트픽쳐스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "케이비에스미디어(주)")
                {
                    rule += "If 제작사/수입사 is 케이비에스미디어(주) -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)울림엔터테인먼트")
                {
                    rule += "If 제작사/수입사 is (주)울림엔터테인먼트 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)두타연")
                {
                    rule += "If 제작사/수입사 is (주)두타연 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)에스비에스콘텐츠허브")
                {
                    rule += "If 제작사/수입사 is (주)에스비에스콘텐츠허브 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "CNR미디어")
                {
                    rule += "If 제작사/수입사 is CNR미디어 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "구혜선 필름")
                {
                    rule += "If 제작사/수입사 is 구혜선 필름 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "제이엠지엔터테인먼트(주)")
                {
                    rule += "If 제작사/수입사 is 제이엠지엔터테인먼트(주) -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)에스엠엔터테인먼트")
                {
                    rule += "If 제작사/수입사 is (주)에스엠엔터테인먼트 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)영화제작전원사")
                {
                    rule += "If 제작사/수입사 is (주)영화제작전원사 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "유니코리아문예투자㈜")
                {
                    rule += "If 제작사/수입사 is 유니코리아문예투자㈜ -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "워너브러더스코리아(주)")
                {
                    rule += "If 제작사/수입사 is 워너브러더스코리아(주) -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)조이앤컨텐츠그룹|(주)액티버스엔터테인먼트")
                {
                    rule += "If 제작사/수입사 is (주)조이앤컨텐츠그룹|(주)액티버스엔터테인먼트 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "필라멘트픽쳐스")
                {
                    rule += "If 제작사/수입사 is 필라멘트픽쳐스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)부메랑모션픽쳐스")
                {
                    rule += "If 제작사/수입사 is (주)부메랑모션픽쳐스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "오퍼스픽쳐스(유)")
                {
                    rule += "If 제작사/수입사 is 오퍼스픽쳐스(유) -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "㈜전망좋은 영화사")
                {
                    rule += "If 제작사/수입사 is ㈜전망좋은 영화사 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "라이온스 게이트 필름즈")
                {
                    rule += "If 제작사/수입사 is 라이온스 게이트 필름즈 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "김기덕 필름")
                {
                    rule += "If 제작사/수입사 is 김기덕 필름 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "드림웍스 애니메이션")
                {
                    rule += "If 제작사/수입사 is 드림웍스 애니메이션 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)드림써치C&C")
                {
                    rule += "If 제작사/수입사 is (주)드림써치C&C -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "한국교육방송공사 EBS")
                {
                    rule += "If 제작사/수입사 is 한국교육방송공사 EBS -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "올리브스튜디오")
                {
                    rule += "If 제작사/수입사 is 올리브스튜디오 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)태원엔터테인먼트")
                {
                    rule += "If 제작사/수입사 is (주)태원엔터테인먼트 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)더타워픽쳐스")
                {
                    rule += "If 제작사/수입사 is (주)더타워픽쳐스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)웰메이드스타엠")
                {
                    rule += "If 제작사/수입사 is (주)웰메이드스타엠 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "나의PS파트너 문화산업전문회사")
                {
                    rule += "If 제작사/수입사 is 나의PS파트너 문화산업전문회사 -> "; res += "1108072 ~ 1888876\n";
                    rule += "1108072 ~ 1888876\n";
                }
                else if (제작사 == "(주)영화사오름")
                {
                    rule += "If 제작사/수입사 is (주)영화사오름 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)삼거리픽쳐스")
                {
                    rule += "If 제작사/수입사 is (주)삼거리픽쳐스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)판타지오")
                {
                    rule += "If 제작사/수입사 is (주)판타지오 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "블루미지")
                {
                    rule += "If 제작사/수입사 is 블루미지 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "영화사청어람(주)")
                {
                    rule += "If 제작사/수입사 is 영화사청어람(주) -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(유)에이디사공육")
                {
                    rule += "If 제작사/수입사 is (유)에이디사공육 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)팔레트픽처스")
                {
                    rule += "If 제작사/수입사 is (주)팔레트픽처스 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)영화사비단길")
                {
                    rule += "If 제작사/수입사 is (주)영화사비단길 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
                else if (제작사 == "(주)케이퍼필름")
                {
                    rule += "If 제작사/수입사 is (주)케이퍼필름 -> "; res += "0 ~ 3547\n";
                    rule += "0 ~ 3547\n";
                }
            }
            else if (감독 == "도미니크 아벨")
            {
                rule += "If 감독 is 도미니크 아벨 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "피오나 고든")
            {
                rule += "If 감독 is 피오나 고든 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "브루노 로미")
            {
                rule += "If 감독 is 브루노 로미 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "야니케 시스타드 야콥슨")
            {
                rule += "If 감독 is 야니케 시스타드 야콥슨 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "랜스 데일리")
            {
                rule += "If 감독 is 랜스 데일리 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "전수일")
            {
                rule += "If 감독 is 전수일 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "안토니오 니그렛")
            {
                rule += "If 감독 is 안토니오 니그렛 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "린 유시엔")
            {
                rule += "If 감독 is 린 유시엔 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "이수정")
            {
                rule += "If 감독 is 이수정 -> "; res += "0 ~ 3547\n";
                rule += "0 ~ 3547\n";
            }
            else if (감독 == "존 힐코트")
            {
                rule += "If 감독 is 존 힐코트 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "마틴 스콜세지")
            {
                rule += "If 감독 is 마틴 스콜세지 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "나가이시 다카오")
            {
                rule += "If 감독 is 나가이시 다카오 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "스티븐 소더버그")
            {
                rule += "If 감독 is 스티븐 소더버그 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "아리엘 슐만")
            {
                rule += "If 감독 is 아리엘 슐만 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "헨리 유스트")
            {
                rule += "If 감독 is 헨리 유스트 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "스콧 데릭슨")
            {
                rule += "If 감독 is 스콧 데릭슨 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "존 매든")
            {
                rule += "If 감독 is 존 매든 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "알렉산더 페인")
            {
                rule += "If 감독 is 알렉산더 페인 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "발타자르 코루마쿠르")
            {
                rule += "If 감독 is 발타자르 코루마쿠르 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "켄 콰피스")
            {
                rule += "If 감독 is 켄 콰피스 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "김조광수")
            {
                rule += "If 감독 is 김조광수 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "매티스 반 헤이닌겐 주니어")
            {
                rule += "If 감독 is 매티스 반 헤이닌겐 주니어 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "제임스 완")
            {
                rule += "If 감독 is 제임스 완 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "로드리고 코르테스")
            {
                rule += "If 감독 is 로드리고 코르테스 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "피트 트래비스")
            {
                rule += "If 감독 is 피트 트래비스 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "곽경택")
            {
                rule += "If 감독 is 곽경택 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "타케우치 요시오")
            {
                rule += "If 감독 is 타케우치 요시오 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "조지 클루니")
            {
                rule += "If 감독 is 조지 클루니 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "린 램지")
            {
                rule += "If 감독 is 린 램지 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "로저 도날드슨")
            {
                rule += "If 감독 is 로저 도날드슨 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "팀 버튼")
            {
                rule += "If 감독 is 팀 버튼 -> "; if (제작사 == "(주)프리비젼엔터테인먼트")
                {
                    rule += "If 제작사/수입사 is (주)프리비젼엔터테인먼트 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)인영트레이딩")
                {
                    rule += "If 제작사/수입사 is (주)인영트레이딩 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)디엔티미디어")
                {
                    rule += "If 제작사/수입사 is (주)디엔티미디어 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "서울시 교육청")
                {
                    rule += "If 제작사/수입사 is 서울시 교육청 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)인벤트스톤")
                {
                    rule += "If 제작사/수입사 is (주)인벤트스톤 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)노마드필름")
                {
                    rule += "If 제작사/수입사 is (주)노마드필름 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)보리픽쳐스")
                {
                    rule += "If 제작사/수입사 is (주)보리픽쳐스 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "씨제이 씨지브이(CJ CGV)(주)")
                {
                    rule += "If 제작사/수입사 is 씨제이 씨지브이(CJ CGV)(주) -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)데이지엔터테인먼트")
                {
                    rule += "If 제작사/수입사 is (주)데이지엔터테인먼트 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)에스와이코마드")
                {
                    rule += "If 제작사/수입사 is (주)에스와이코마드 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)레인보우팩토리")
                {
                    rule += "If 제작사/수입사 is (주)레인보우팩토리 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "판씨네마㈜")
                {
                    rule += "If 제작사/수입사 is 판씨네마㈜ -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)루믹스미디어")
                {
                    rule += "If 제작사/수입사 is (주)루믹스미디어 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)영화사 조제")
                {
                    rule += "If 제작사/수입사 is (주)영화사 조제 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)컴퍼니엘")
                {
                    rule += "If 제작사/수입사 is (주)컴퍼니엘 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)조이앤컨텐츠그룹")
                {
                    rule += "If 제작사/수입사 is (주)조이앤컨텐츠그룹 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "㈜영화사 백두대간")
                {
                    rule += "If 제작사/수입사 is ㈜영화사 백두대간 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(재)전주국제영화제조직위원회")
                {
                    rule += "If 제작사/수입사 is (재)전주국제영화제조직위원회 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "애즈필름")
                {
                    rule += "If 제작사/수입사 is 애즈필름 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "얼라이브픽쳐스")
                {
                    rule += "If 제작사/수입사 is 얼라이브픽쳐스 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "경픽쳐스")
                {
                    rule += "If 제작사/수입사 is 경픽쳐스 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "미디어소프트")
                {
                    rule += "If 제작사/수입사 is 미디어소프트 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "데이브인터랙티브")
                {
                    rule += "If 제작사/수입사 is 데이브인터랙티브 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "가나미디어")
                {
                    rule += "If 제작사/수입사 is 가나미디어 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "㈜미로비젼")
                {
                    rule += "If 제작사/수입사 is ㈜미로비젼 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)인디컴미디어")
                {
                    rule += "If 제작사/수입사 is (주)인디컴미디어 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "반이다")
                {
                    rule += "If 제작사/수입사 is 반이다 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "스튜디오 오후출근")
                {
                    rule += "If 제작사/수입사 is 스튜디오 오후출근 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)시네마달")
                {
                    rule += "If 제작사/수입사 is (주)시네마달 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)스폰지이엔티")
                {
                    rule += "If 제작사/수입사 is (주)스폰지이엔티 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)영화사 자미")
                {
                    rule += "If 제작사/수입사 is (주)영화사 자미 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)나이너스엔터테인먼트")
                {
                    rule += "If 제작사/수입사 is (주)나이너스엔터테인먼트 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "찬란")
                {
                    rule += "If 제작사/수입사 is 찬란 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)수필름")
                {
                    rule += "If 제작사/수입사 is (주)수필름 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "포디렉터스")
                {
                    rule += "If 제작사/수입사 is 포디렉터스 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "씨네21아이(주)")
                {
                    rule += "If 제작사/수입사 is 씨네21아이(주) -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)영화사 진진")
                {
                    rule += "If 제작사/수입사 is (주)영화사 진진 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "㈜인디스토리")
                {
                    rule += "If 제작사/수입사 is ㈜인디스토리 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "러브락컴퍼니")
                {
                    rule += "If 제작사/수입사 is 러브락컴퍼니 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)누리픽쳐스")
                {
                    rule += "If 제작사/수입사 is (주)누리픽쳐스 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "롤러코스터")
                {
                    rule += "If 제작사/수입사 is 롤러코스터 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "피엠피앤컴퍼니")
                {
                    rule += "If 제작사/수입사 is 피엠피앤컴퍼니 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)인스터피씨엠")
                {
                    rule += "If 제작사/수입사 is (주)인스터피씨엠 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "라인트리엔터테인먼트")
                {
                    rule += "If 제작사/수입사 is 라인트리엔터테인먼트 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "다카포필름")
                {
                    rule += "If 제작사/수입사 is 다카포필름 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "독립프로덕션빨간눈사람")
                {
                    rule += "If 제작사/수입사 is 독립프로덕션빨간눈사람 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)키노아이디엠씨")
                {
                    rule += "If 제작사/수입사 is (주)키노아이디엠씨 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "㈜코리아스크린")
                {
                    rule += "If 제작사/수입사 is ㈜코리아스크린 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)피터팬픽쳐스")
                {
                    rule += "If 제작사/수입사 is (주)피터팬픽쳐스 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "에스비에스 바이아컴 유한회사")
                {
                    rule += "If 제작사/수입사 is 에스비에스 바이아컴 유한회사 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)소나무픽쳐스")
                {
                    rule += "If 제작사/수입사 is (주)소나무픽쳐스 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)영화사폴")
                {
                    rule += "If 제작사/수입사 is (주)영화사폴 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)마운틴픽쳐스")
                {
                    rule += "If 제작사/수입사 is (주)마운틴픽쳐스 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "씨제이이앤엠 주식회사")
                {
                    rule += "If 제작사/수입사 is 씨제이이앤엠 주식회사 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "얼리버드")
                {
                    rule += "If 제작사/수입사 is 얼리버드 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)케빈앤컴퍼니")
                {
                    rule += "If 제작사/수입사 is (주)케빈앤컴퍼니 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "프로덕션공방")
                {
                    rule += "If 제작사/수입사 is 프로덕션공방 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)이든픽쳐스")
                {
                    rule += "If 제작사/수입사 is (주)이든픽쳐스 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "한국소니픽쳐스릴리징브에나비스타영화㈜")
                {
                    rule += "If 제작사/수입사 is 한국소니픽쳐스릴리징브에나비스타영화㈜ -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "스토리룸")
                {
                    rule += "If 제작사/수입사 is 스토리룸 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "LEE FILM")
                {
                    rule += "If 제작사/수입사 is LEE FILM -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)나우콘텐츠")
                {
                    rule += "If 제작사/수입사 is (주)나우콘텐츠 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)트리니티네트워크")
                {
                    rule += "If 제작사/수입사 is (주)트리니티네트워크 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)엣나인필름")
                {
                    rule += "If 제작사/수입사 is (주)엣나인필름 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "한국영화아카데미")
                {
                    rule += "If 제작사/수입사 is 한국영화아카데미 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)영화사조아")
                {
                    rule += "If 제작사/수입사 is (주)영화사조아 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "영화사 도로시(주)")
                {
                    rule += "If 제작사/수입사 is 영화사 도로시(주) -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)미디어로그")
                {
                    rule += "If 제작사/수입사 is (주)미디어로그 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "피디픽쳐스")
                {
                    rule += "If 제작사/수입사 is 피디픽쳐스 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)스테이지팩토리")
                {
                    rule += "If 제작사/수입사 is (주)스테이지팩토리 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "알토미디어(주)")
                {
                    rule += "If 제작사/수입사 is 알토미디어(주) -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "엠투")
                {
                    rule += "If 제작사/수입사 is 엠투 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)아우라픽처스")
                {
                    rule += "If 제작사/수입사 is (주)아우라픽처스 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "엔터시네마")
                {
                    rule += "If 제작사/수입사 is 엔터시네마 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)키노크러시")
                {
                    rule += "If 제작사/수입사 is (주)키노크러시 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)스넵쏘울")
                {
                    rule += "If 제작사/수입사 is (주)스넵쏘울 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "영화사뜰(주)")
                {
                    rule += "If 제작사/수입사 is 영화사뜰(주) -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "키노망고스틴")
                {
                    rule += "If 제작사/수입사 is 키노망고스틴 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "킹레코드")
                {
                    rule += "If 제작사/수입사 is 킹레코드 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "잉스팅크티브 필름")
                {
                    rule += "If 제작사/수입사 is 잉스팅크티브 필름 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "스파이럴 프로젝트")
                {
                    rule += "If 제작사/수입사 is 스파이럴 프로젝트 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "플라잉타이거픽처스")
                {
                    rule += "If 제작사/수입사 is 플라잉타이거픽처스 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "페퍼민트픽쳐스")
                {
                    rule += "If 제작사/수입사 is 페퍼민트픽쳐스 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "스피나치앤빈")
                {
                    rule += "If 제작사/수입사 is 스피나치앤빈 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)다세포클럽")
                {
                    rule += "If 제작사/수입사 is (주)다세포클럽 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)동녘필름")
                {
                    rule += "If 제작사/수입사 is (주)동녘필름 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "영화제작소 다")
                {
                    rule += "If 제작사/수입사 is 영화제작소 다 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)부메랑모션픽쳐스|(주)드림웨스트픽쳐스")
                {
                    rule += "If 제작사/수입사 is (주)부메랑모션픽쳐스|(주)드림웨스트픽쳐스 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "대원미디어㈜")
                {
                    rule += "If 제작사/수입사 is 대원미디어㈜ -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "파라마운트")
                {
                    rule += "If 제작사/수입사 is 파라마운트 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "이십세기폭스코리아(주)")
                {
                    rule += "If 제작사/수입사 is 이십세기폭스코리아(주) -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "유니버설픽쳐스인터내셔널 코리아(유)")
                {
                    rule += "If 제작사/수입사 is 유니버설픽쳐스인터내셔널 코리아(유) -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "청년필름(주)")
                {
                    rule += "If 제작사/수입사 is 청년필름(주) -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "한국게이인권운동단체 친구사이")
                {
                    rule += "If 제작사/수입사 is 한국게이인권운동단체 친구사이 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)포커스앤컴퍼니")
                {
                    rule += "If 제작사/수입사 is (주)포커스앤컴퍼니 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)트리니티엔터테인먼트")
                {
                    rule += "If 제작사/수입사 is (주)트리니티엔터테인먼트 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "에이원엔터테인먼트")
                {
                    rule += "If 제작사/수입사 is 에이원엔터테인먼트 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)티캐스트")
                {
                    rule += "If 제작사/수입사 is (주)티캐스트 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "쇼박스㈜미디어플렉스")
                {
                    rule += "If 제작사/수입사 is 쇼박스㈜미디어플렉스 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "소니픽쳐스릴리징월트디즈니스튜디오스코리아(주)")
                {
                    rule += "If 제작사/수입사 is 소니픽쳐스릴리징월트디즈니스튜디오스코리아(주) -> "; res += "3547 ~ 64195\n";
                    rule += "3547 ~ 64195\n";
                }
                else if (제작사 == "(주)메인타이틀픽쳐스")
                {
                    rule += "If 제작사/수입사 is (주)메인타이틀픽쳐스 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)드림웨스트픽쳐스")
                {
                    rule += "If 제작사/수입사 is (주)드림웨스트픽쳐스 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "케이비에스미디어(주)")
                {
                    rule += "If 제작사/수입사 is 케이비에스미디어(주) -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)울림엔터테인먼트")
                {
                    rule += "If 제작사/수입사 is (주)울림엔터테인먼트 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)두타연")
                {
                    rule += "If 제작사/수입사 is (주)두타연 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)에스비에스콘텐츠허브")
                {
                    rule += "If 제작사/수입사 is (주)에스비에스콘텐츠허브 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "CNR미디어")
                {
                    rule += "If 제작사/수입사 is CNR미디어 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "구혜선 필름")
                {
                    rule += "If 제작사/수입사 is 구혜선 필름 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "제이엠지엔터테인먼트(주)")
                {
                    rule += "If 제작사/수입사 is 제이엠지엔터테인먼트(주) -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)에스엠엔터테인먼트")
                {
                    rule += "If 제작사/수입사 is (주)에스엠엔터테인먼트 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)영화제작전원사")
                {
                    rule += "If 제작사/수입사 is (주)영화제작전원사 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "유니코리아문예투자㈜")
                {
                    rule += "If 제작사/수입사 is 유니코리아문예투자㈜ -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "워너브러더스코리아(주)")
                {
                    rule += "If 제작사/수입사 is 워너브러더스코리아(주) -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)조이앤컨텐츠그룹|(주)액티버스엔터테인먼트")
                {
                    rule += "If 제작사/수입사 is (주)조이앤컨텐츠그룹|(주)액티버스엔터테인먼트 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "필라멘트픽쳐스")
                {
                    rule += "If 제작사/수입사 is 필라멘트픽쳐스 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)부메랑모션픽쳐스")
                {
                    rule += "If 제작사/수입사 is (주)부메랑모션픽쳐스 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "오퍼스픽쳐스(유)")
                {
                    rule += "If 제작사/수입사 is 오퍼스픽쳐스(유) -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "㈜전망좋은 영화사")
                {
                    rule += "If 제작사/수입사 is ㈜전망좋은 영화사 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "라이온스 게이트 필름즈")
                {
                    rule += "If 제작사/수입사 is 라이온스 게이트 필름즈 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "김기덕 필름")
                {
                    rule += "If 제작사/수입사 is 김기덕 필름 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "드림웍스 애니메이션")
                {
                    rule += "If 제작사/수입사 is 드림웍스 애니메이션 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)드림써치C&C")
                {
                    rule += "If 제작사/수입사 is (주)드림써치C&C -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "한국교육방송공사 EBS")
                {
                    rule += "If 제작사/수입사 is 한국교육방송공사 EBS -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "올리브스튜디오")
                {
                    rule += "If 제작사/수입사 is 올리브스튜디오 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)태원엔터테인먼트")
                {
                    rule += "If 제작사/수입사 is (주)태원엔터테인먼트 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)더타워픽쳐스")
                {
                    rule += "If 제작사/수입사 is (주)더타워픽쳐스 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)웰메이드스타엠")
                {
                    rule += "If 제작사/수입사 is (주)웰메이드스타엠 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "나의PS파트너 문화산업전문회사")
                {
                    rule += "If 제작사/수입사 is 나의PS파트너 문화산업전문회사 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)영화사오름")
                {
                    rule += "If 제작사/수입사 is (주)영화사오름 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)삼거리픽쳐스")
                {
                    rule += "If 제작사/수입사 is (주)삼거리픽쳐스 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)판타지오")
                {
                    rule += "If 제작사/수입사 is (주)판타지오 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "블루미지")
                {
                    rule += "If 제작사/수입사 is 블루미지 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "영화사청어람(주)")
                {
                    rule += "If 제작사/수입사 is 영화사청어람(주) -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(유)에이디사공육")
                {
                    rule += "If 제작사/수입사 is (유)에이디사공육 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)팔레트픽처스")
                {
                    rule += "If 제작사/수입사 is (주)팔레트픽처스 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)영화사비단길")
                {
                    rule += "If 제작사/수입사 is (주)영화사비단길 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
                else if (제작사 == "(주)케이퍼필름")
                {
                    rule += "If 제작사/수입사 is (주)케이퍼필름 -> "; res += "339294 ~ 615783\n";
                    rule += "339294 ~ 615783\n";
                }
            }
            else if (감독 == "이나 예블라니코바")
            {
                rule += "If 감독 is 이나 예블라니코바 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "스비야토슬라브 우샤코프")
            {
                rule += "If 감독 is 스비야토슬라브 우샤코프 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "아몰 굽트")
            {
                rule += "If 감독 is 아몰 굽트 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "파스칼 쇼메유")
            {
                rule += "If 감독 is 파스칼 쇼메유 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "손석")
            {
                rule += "If 감독 is 손석 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "맥스 기와")
            {
                rule += "If 감독 is 맥스 기와 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "다니아 파스퀴니")
            {
                rule += "If 감독 is 다니아 파스퀴니 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "더 비셔우스 브라더스")
            {
                rule += "If 감독 is 더 비셔우스 브라더스 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "정재은")
            {
                rule += "If 감독 is 정재은 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "브라이언 클러그만")
            {
                rule += "If 감독 is 브라이언 클러그만 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "리 스턴탈")
            {
                rule += "If 감독 is 리 스턴탈 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "구파도")
            {
                rule += "If 감독 is 구파도 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "구혜선")
            {
                rule += "If 감독 is 구혜선 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "마커스 니스펠")
            {
                rule += "If 감독 is 마커스 니스펠 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "최진성")
            {
                rule += "If 감독 is 최진성 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "다비드 포앙키노스")
            {
                rule += "If 감독 is 다비드 포앙키노스 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "스테판 포엔키노스")
            {
                rule += "If 감독 is 스테판 포엔키노스 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "홍상수")
            {
                rule += "If 감독 is 홍상수 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "데클란 도넬란")
            {
                rule += "If 감독 is 데클란 도넬란 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "닉 오머로드")
            {
                rule += "If 감독 is 닉 오머로드 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "로버트 로렌즈")
            {
                rule += "If 감독 is 로버트 로렌즈 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "데이빗 크로넨버그")
            {
                rule += "If 감독 is 데이빗 크로넨버그 -> "; res += "3547 ~ 64195\n";
                rule += "3547 ~ 64195\n";
            }
            else if (감독 == "조지 밀러")
            {
                rule += "If 감독 is 조지 밀러 -> "; res += "64195 ~ 188648\n";
                rule += "64195 ~ 188648\n";
            }
            else if (감독 == "후안 디에고 솔라나스")
            {
                rule += "If 감독 is 후안 디에고 솔라나스 -> "; res += "64195 ~ 188648\n";
                rule += "64195 ~ 188648\n";
            }
            else if (감독 == "론 쉐르픽")
            {
                rule += "If 감독 is 론 쉐르픽 -> "; res += "64195 ~ 188648\n";
                rule += "64195 ~ 188648\n";
            }
            else if (감독 == "쿠스바 고조")
            {
                rule += "If 감독 is 쿠스바 고조 -> "; res += "64195 ~ 188648\n";
                rule += "64195 ~ 188648\n";
            }
            else if (감독 == "다니엘 에스피노사")
            {
                rule += "If 감독 is 다니엘 에스피노사 -> "; res += "64195 ~ 188648\n";
                rule += "64195 ~ 188648\n";
            }
            else if (감독 == "크리스 고락")
            {
                rule += "If 감독 is 크리스 고락 -> "; res += "64195 ~ 188648\n";
                rule += "64195 ~ 188648\n";
            }
            else if (감독 == "제임스 맥티그")
            {
                rule += "If 감독 is 제임스 맥티그 -> "; res += "64195 ~ 188648\n";
                rule += "64195 ~ 188648\n";
            }
            else if (감독 == "필리다 로이드")
            {
                rule += "If 감독 is 필리다 로이드 -> "; res += "64195 ~ 188648\n";
                rule += "64195 ~ 188648\n";
            }
            else if (감독 == "벤 애플렉")
            {
                rule += "If 감독 is 벤 애플렉 -> "; res += "64195 ~ 188648\n";
                rule += "64195 ~ 188648\n";
            }
            else if (감독 == "마이크 맥코이")
            {
                rule += "If 감독 is 마이크 맥코이 -> "; res += "64195 ~ 188648\n";
                rule += "64195 ~ 188648\n";
            }
            else if (감독 == "스콧 워")
            {
                rule += "If 감독 is 스콧 워 -> "; res += "64195 ~ 188648\n";
                rule += "64195 ~ 188648\n";
            }
            else if (감독 == "하나부사 츠토무")
            {
                rule += "If 감독 is 하나부사 츠토무 -> "; res += "64195 ~ 188648\n";
                rule += "64195 ~ 188648\n";
            }
            else if (감독 == "김진영")
            {
                rule += "If 감독 is 김진영 -> "; res += "188648 ~ 339294\n";
                rule += "188648 ~ 339294\n";
            }
            else if (감독 == "정지영")
            {
                rule += "If 감독 is 정지영 -> "; res += "188648 ~ 339294\n";
                rule += "188648 ~ 339294\n";
            }
            else if (감독 == "정범식")
            {
                rule += "If 감독 is 정범식 -> "; res += "188648 ~ 339294\n";
                rule += "188648 ~ 339294\n";
            }
            else if (감독 == "임대웅")
            {
                rule += "If 감독 is 임대웅 -> "; res += "188648 ~ 339294\n";
                rule += "188648 ~ 339294\n";
            }
            else if (감독 == "김선")
            {
                rule += "If 감독 is 김선 -> "; res += "188648 ~ 339294\n";
                rule += "188648 ~ 339294\n";
            }
            else if (감독 == "민규동")
            {
                rule += "If 감독 is 민규동 -> "; res += "188648 ~ 339294\n";
                rule += "188648 ~ 339294\n";
            }
            else if (감독 == "호소다 마모루")
            {
                rule += "If 감독 is 호소다 마모루 -> "; res += "188648 ~ 339294\n";
                rule += "188648 ~ 339294\n";
            }
            else if (감독 == "박철관")
            {
                rule += "If 감독 is 박철관 -> "; res += "339294 ~ 615783\n";
                rule += "339294 ~ 615783\n";
            }
            else if (감독 == "게리 로스")
            {
                rule += "If 감독 is 게리 로스 -> "; res += "339294 ~ 615783\n";
                rule += "339294 ~ 615783\n";
            }
            else if (감독 == "김기덕")
            {
                rule += "If 감독 is 김기덕 -> "; res += "339294 ~ 615783\n";
                rule += "339294 ~ 615783\n";
            }
            else if (감독 == "애스게르 레스")
            {
                rule += "If 감독 is 애스게르 레스 -> "; res += "339294 ~ 615783\n";
                rule += "339294 ~ 615783\n";
            }
            else if (감독 == "타셈 싱")
            {
                rule += "If 감독 is 타셈 싱 -> "; res += "339294 ~ 615783\n";
                rule += "339294 ~ 615783\n";
            }
            else if (감독 == "라이언 존슨")
            {
                rule += "If 감독 is 라이언 존슨 -> "; res += "339294 ~ 615783\n";
                rule += "339294 ~ 615783\n";
            }
            else if (감독 == "피터 램지")
            {
                rule += "If 감독 is 피터 램지 -> "; res += "615783 ~ 1108072\n";
                rule += "615783 ~ 1108072\n";
            }
            else if (감독 == "한상호")
            {
                rule += "If 감독 is 한상호 -> "; res += "615783 ~ 1108072\n";
                rule += "615783 ~ 1108072\n";
            }
            else if (감독 == "토니 길로이")
            {
                rule += "If 감독 is 토니 길로이 -> "; res += "615783 ~ 1108072\n";
                rule += "615783 ~ 1108072\n";
            }
            else if (감독 == "정용기")
            {
                rule += "If 감독 is 정용기 -> "; res += "615783 ~ 1108072\n";
                rule += "615783 ~ 1108072\n";
            }
            else if (감독 == "문현성")
            {
                rule += "If 감독 is 문현성 -> "; res += "1108072 ~ 1888876\n";
                rule += "1108072 ~ 1888876\n";
            }
            else if (감독 == "정기훈")
            {
                rule += "If 감독 is 정기훈 -> "; res += "1108072 ~ 1888876\n";
                rule += "1108072 ~ 1888876\n";
            }
            else if (감독 == "전계수")
            {
                rule += "If 감독 is 전계수 -> "; res += "1108072 ~ 1888876\n";
                rule += "1108072 ~ 1888876\n";
            }
            else if (감독 == "올리비에 나카슈")
            {
                rule += "If 감독 is 올리비에 나카슈 -> "; res += "1108072 ~ 1888876\n";
                rule += "1108072 ~ 1888876\n";
            }
            else if (감독 == "에릭 톨레다노")
            {
                rule += "If 감독 is 에릭 톨레다노 -> "; res += "1108072 ~ 1888876\n";
                rule += "1108072 ~ 1888876\n";
            }
            else if (감독 == "스티브 마티노")
            {
                rule += "If 감독 is 스티브 마티노 -> "; res += "1108072 ~ 1888876\n";
                rule += "1108072 ~ 1888876\n";
            }
            else if (감독 == "마이크 트메이어")
            {
                rule += "If 감독 is 마이크 트메이어 -> "; res += "1108072 ~ 1888876\n";
                rule += "1108072 ~ 1888876\n";
            }
            else if (감독 == "톰 후퍼")
            {
                rule += "If 감독 is 톰 후퍼 -> "; res += "1888876 ~ 3240545\n";
                rule += "1888876 ~ 3240545\n";
            }
            else if (감독 == "조근현")
            {
                rule += "If 감독 is 조근현 -> "; res += "1888876 ~ 3240545\n";
                rule += "1888876 ~ 3240545\n";
            }
            else if (감독 == "정병길")
            {
                rule += "If 감독 is 정병길 -> "; res += "1888876 ~ 3240545\n";
                rule += "1888876 ~ 3240545\n";
            }
            else if (감독 == "김주호")
            {
                rule += "If 감독 is 김주호 -> "; res += "3240545 ~ 5644069\n";
                rule += "3240545 ~ 5644069\n";
            }
            else if (감독 == "마크 웹")
            {
                rule += "If 감독 is 마크 웹 -> "; res += "3240545 ~ 5644069\n";
                rule += "3240545 ~ 5644069\n";
            }
            else if (감독 == "윤종빈")
            {
                rule += "If 감독 is 윤종빈 -> "; res += "3240545 ~ 5644069\n";
                rule += "3240545 ~ 5644069\n";
            }
            else if (감독 == "조스 웨던")
            {
                rule += "If 감독 is 조스 웨던 -> "; res += "5644069 ~ 11376139\n";
                rule += "5644069 ~ 11376139\n";
            }
            else if (감독 == "조성희")
            {
                rule += "If 감독 is 조성희 -> "; res += "5644069 ~ 11376139\n";
                rule += "5644069 ~ 11376139\n";
            }
            else if (감독 == "최동훈")
            {
                rule += "If 감독 is 최동훈 -> "; res += "11376139 ~\n";
                rule += "11376139 ~\n";
            }

            
            return res;
        }
    }
}
